[
    {
        "index": 1,
        "label": "Food",
        "title": "The Antioxidant Avenger Smoothie from \"Blender Girl\" Tess Masters",
        "body": "Tess Masters is the first to admit she's not a trained chef, but she has been experimenting with food for as long as she can remember. As a smoothie-obsessed teen, she started exploring the various virtues of the blender as a food prep tool, and she has never looked back. It was also starting in her teen years -- after a diagnosis of Epstein-Barr virus -- that Masters began searching for the perfect diet to help her feel healthier. Macrobiotic, vegan, raw food -- you name it, she tried it. Ultimately, what she discovered is that her perfect diet (like everyone's) was a blend. And so, The Blender Girl was born, and this spring, The Blender Girl Cookbook.  Let's start with the obvious question: Why the blender as the basis for all your recipes? It's an extremely accessible way to prepare food. It’s not like baking or other techniques that involve chemistry and require real skill. With blending, you really can't screw it up, which makes it very appealing to novice cooks. Plus, it's really fast. Time is the most precious commodity we have, and I don't want to compromise health, nutrition or taste just because I'm short on time. What's the most surprising creation to come out of your blender? I think maybe my curry smoothie. I like to make smoothies that have interesting combinations of flavors and textures -- just like a real meal. This one has spices and even chopped onion which give it the dimension, taste and texture of a true meal experience. Are you advocating an all-smoothie diet? No, the whole point is that there's so much more you can do with a blender than juices and smoothies. You don't need to check your teeth at the door. You can use the blender to make -- or enhance -- plenty of foods you can sink your teeth into. Like a chimichurri sauce for chicken, salad dressings, cake batters.  What are your favorite, unexpected, ingredients? Miso paste would be number one on that list. You can use it in so many things, but my best discovery is that white miso paste totally replicates the taste of aged Parmesan cheese when I use it to make vegan pesto. I also love using the leafy greens no one else wants. I'll go to the farmers market and vendors will give me bags of free beet greens, radish greens and carrot greens that other customers asked them to cut off and toss. And raw almonds, cashews and macadamia nuts are staples in my kitchen. Toss just a handful into a soup or smoothie and it replicates the creaminess of adding real cream. You've said that blending isn't just a food prep technique but a metaphor for how you live your life. Explain. What I call the perfect blend goes beyond food -- it's also about work, exercise, spirituality, relationships. And your diet should be a blend too. I do believe that you really can help heal your body with food. But food should also be fun. It's one of the great pleasures in life. I purposely designed all the recipes in the book to be tweaked and personalized so that everyone can turn them into their own perfect blend. Antioxidant Avenger  Serves 2     ½ cup (120ml) coconut water       ½ teaspoon probiotic powder (optional)   1 packet (3.5 ounces/100g) frozen acai pulp, or 2 tablespoons dried acai powder     2 teaspoons maqui powder   2 cups (320g) mixed fresh or frozen berries (1/2 cup each of blueberries, blackberries, raspberries and strawberries)     ½ cup (85g) red seedless grapes       1 ripe pear, skin on, cored and diced       ½ teaspoon minced ginger (optional)       ¼ teaspoon ground cinnamon (optional)       ½ teaspoon finely grated orange zest (optional)     1 cup (125g) ice cubes       1 chopped pitted date, soaked   Throw everything into your blender and puree on high for 30 to 60 seconds, until smooth and creamy. Tweak the sweetness to taste. Sally Wadyka is a Boulder, Colorado-based journalist who writes about nutrition, health and wellness. Recipe and photos reprinted with permission from The Blender Girl by Tess Masters, copyright (c) 2014. Published by Ten Speed Press, an imprint of Random House LLC. Photography (c) 2014 by Anson Smart",
        "words_count": 699
    },
    {
        "index": 2,
        "label": "Food",
        "title": "Suffer from Headaches? Tweaking Your Diet Might Help",
        "body": "Nearly one in four households has someone who suffers from migraine headaches, and tension-type headaches are even more common. The causes of both of these headache types aren’t fully understood; however, there are some smart eating strategies that may help decrease frequency, or even help prevent headaches. Headaches have complex causes and symptoms. “Tension-type headaches usually involve the tightening of muscles in the head, neck shoulder and jaw,” says Daniel Mattson, MD, neurologist at SSM Health Medical Group in St. Louis. Migraines can result from the pain caused when brain blood vessels swell, pressing on nerves, explains Mattson. “And visual and sensory changes common with a migraine aura can be caused by a disruption of brain signaling chemicals.” The list of dietary factors that can contribute to a headache include these potential triggers: alcohol, coffee, soda, beans, citrus, artificial sweeteners, nuts, cured meats, aged cheeses, MSG, chocolate. The problem is that none of these foods have actually been proven to cause headaches, says Mattson. For example, some researchers have noted that migraine sufferers may crave chocolate when they are about to experience a migraine, thus eating chocolate might be associated with a headache. In addition, many of these foods including chocolate, nuts, beans and dairy foods are important sources of magnesium and riboflavin, which have been found to help with headaches. “Magnesium works inside cells to relax contraction that contributes to tension headaches,” says Ashley Koff, RD, registered dietitian at The Better Nutrition Program. Magnesium may help stabilize brain chemicals in migraines and even decrease or block pain transmitters notes Koff. To help handle headaches, try these dietary strategies. What May Help Relieve Headaches Do keep a headache diary. Track the foods you ate 24 hours before a headache began. Download a free headache journal from the American Migraine Foundation. Do manage your caffeine. For some people, caffeine can help migraines because it constricts enlarged blood vessels in the brain. But for others, too much caffeine (or caffeine withdrawal) is a migraine trigger. Do eat foods high in magnesium. A majority of Americans don’t get enough magnesium and this mineral need may be even higher for headache sufferers. Koff recommends food first to help meet requirements beginning with four servings daily of the following magnesium-rich foods: 1/2 cup kidney, pinto or black beans; 1/3 cup peanuts or pumpkin seeds; 2 oz dark chocolate; 1 1/2 cup cooked oatmeal or barley; 3/4 cup cooked greens. For those that can’t or choose not to eat foods with magnesium, supplementation may be indicated. Koff recommends working with a registered dietitian to determine intake needs. Do eat foods high in riboflavin. Also known as vitamin B2, riboflavin is involved in energy production, including in brain cells. In one study, riboflavin supplements were linked to lower incidence of migraines in headache sufferers. Beef, enriched tofu, milk, seafood, mushrooms, eggs, nuts, greens, fortified breakfast cereals and bread made with enriched flour all contain riboflavin. What Might Make Symptoms Worse Don’t dump all potential food triggers at once. Not only can you be missing out on important nutrients, but you’ll be unable to decipher which food is a potential trigger. Don’t get dehydrated. Dehydration can be a big trigger for headaches. Flavored drinks and iced tea can hydrate, but they can also contain caffeine. Stick to plain herbal tea, water or add just a splash of an electrolyte-rich sports drink to water for some flavor. Don’t skip meals. For both tension and migraine headaches, not eating regularly can contribute to onset. Eating meals and snacks at nearly the same times every day keeps the blood sugar at a more stable level to nourish the brain. Skipping meals causes the body stress. And stress in any form, from physical to mental is often a factor in headaches. Eating six smaller meals throughout the day can help. Don’t get a lot of calcium without getting plenty of magnesium. If you eat a lot of dairy foods or take calcium supplements, make sure you’re getting enough magnesium too, as these minerals work together in the body. “Often I see patients whose intake of calcium, especially supplemental, is creating a conditional imbalance with magnesium which can contribute to headaches,” explains Koff. Serena Ball, MS, RD is a registered dietitian nutritionist, food writer, and mom of four children. She blogs at TeaspoonOfSpice.com and is the author of the best-selling The 30-Minute Mediterranean Diet Cookbook. Follow her @TspCurry on Twitter and Instagram. *This article was written and/or reviewed by an independent registered dietitian nutritionist. Related Content: Healthy Dinners in 40 Minutes or Less Nutritionists Favorite Work-from-Home Lunches Our Most-Saved Healthy Recipes",
        "words_count": 768
    },
    {
        "index": 3,
        "label": "Food",
        "title": "Talking To The Experts: Clean Eating Cookbook Author Michelle Dudash",
        "body": "Clean eating has been around since the 1960s but has been gaining popularity recently. Registered dietitian Michelle Dudash author of Clean Eating for Busy Families explains how simple it is to follow. Q. Could you explain what clean eating is? Clean eating is the lifestyle of enjoying foods in their most natural and least processed state, including fruits and vegetables, whole grains, lean proteins, nuts and seeds, lowfat dairy and expeller-pressed oils. For example, instead of eating white bread, seek out sprouted wheat bread, which is a true whole grain. Also, if you can't pronounce an ingredient on the label, you probably shouldn't eat it. Instead of components that sound like things from lab experiments, opt for foods with ingredients found in home kitchens. Clean eating to me also means opting for in-season foods—not just produce, but seafood, too—whenever possible. Q. So many foods marketed to kids are processed -- how can you eliminate or minimize processed foods, and how can you tell which packaged foods are clean? Unfortunately, many foods marketed to kids can be deceiving. You must look past the healthy images on the front of the package and go straight to the ingredient label on the back. If you see sugar in any form (yes, even evaporated cane juice and brown rice syrup) as the first ingredient, put it down. If it's a grain product like a bar or cereal, whole grains like oats or brown rice should be listed first. If you see more than a few ingredients you can't pronounce, it's probably been manipulated and is highly processed. Despite the widespread availability of processed kids' snacks, remember, kids still love fruits and vegetables or whole-grain crackers paired with dip. Q. What are 3 tips for parents to help them prepare healthy, wholesome meals in a flash? Properly stock your kitchen. In the time it would take you to call in your takeout order, drive in traffic, wait in line and get back home, you could have prepared a fresh meal, provided that you had the needed supplies. My book offers weekly, monthly and quarterly shopping lists.Plan meals ahead and have a go-to recipe arsenal. Planning ahead can be as detailed as writing out a monthly or weekly calendar of dinner menus, or as free-spirited as simply having three fresh proteins and vegetables on hand for the week. Plan your meals out Saturday, do all of your shopping on Sunday and as soon as you get home on weeknights, you'll be ready to start dinner.Make one-dish or make-ahead meals whenever possible. One-dish meals that contain a vegetable, protein and complex carbohydrate are a lifesaver--and dish saver! Recipes that you can make ahead in the slow cooker or have ready to just pop in the oven open up space during the mad evening rush. Q. Many parents complain that their kids are picky eaters. What are ways to help parents overcome their frustration? \"Healthify\" favorites. If your child loves fast-food chicken nuggets, try my Pecan Crusted Chicken Tenders with Dill Dip. Use familiar foods as the vehicle to get kids to eat foreign foods.Have whisk, will try it. Involving your child in the cooking process will result in them being more likely to try the foods that they help prepare.Don't Give Up. Continue to offer, not force, a variety of foods, namely vegetables, with most meals. It can take eight to ten exposures before a child decides whether she likes a new food or will even try it! Eventually, your child will probably surprise you. Q. What 5 items are most essential to stock up on regularly? My top five weekly grocery items are fresh in-season vegetables, fresh in-season fruit, hummus, Greek yogurt, and fresh proteins like seafood and chicken. If you’re not a \"hummus family\" then low fat milk is my next essential ingredient I buy almost every week. Q. What are your favorite kitchen tools that you'd recommend every parent have to help make cooking a little easier? Good-quality, 12-inch frying pan with ovenproof handle (the workhorse of the busy family kitchen) for quick sautés and griddled sandwichesGood, sharp knivesSmall, medium, and large cutting boards—flat ones, not warped onesLemon and lime presses or reamersGood pepper mill (I always use freshly ground pepper instead of the bottled dusty stuff.)Parchment paper and silicone baking mats for easy pan cleanupSalad spinner for washing, draining, and drying fruits, vegetables and herbs Q. Could you share a recipe from your new book? Pistachio and Whole-Grain Tortilla Crusted Tilapia With Chili Lime Sauce For tilapia:     1 large egg       ¼ cup finely chopped cilantro       1 teaspoon Dijon mustard   ½ cup crushed whole-grain tortilla chips (from about 12 large whole chips)     ¼ cup finely chopped pistachios       1 teaspoon ground cumin       ½ teaspoon garlic powder       ¼ teaspoon chili powder       ¼ teaspoon salt       ¼ teaspoon freshly ground black pepper   1 pound tilapia fillets, cut into at least 4 portions (or cod, haddock) For sauce:     ¼ cup light mayonnaise       1 teaspoon lime juice       1 pinch chili powder       1 pinch salt   To make the tilapia: Preheat oven to 425°F (220°C, or gas mark 7). Line a large sheet pan with parchment paper or a silicone baking mat. Whisk egg, cilantro, mustard, and 1 teaspoon (5 ml) of water together in a shallow dish. In another dish, combine chips, pistachios, cumin, garlic powder, chili powder, salt, and pepper. Dip fish in egg mixture, coating on both sides, and then coat fish well in breading. Place fish on pan with rounded side up. Bake for 14 minutes until golden on the outside and opaque and slightly firm in the center. To make the sauce: Blend all sauce ingredients. Serve the fish immediately with the sauce. Total Prep and Cook Time: 40 minutes   Yield: 4 servings, 1 large or 2 small pieces of tilapia each (with 1 tablespoon of sauce) Nutrition information per serving: 264 calories; 18 grams total fat; 2 grams saturated fat; 25 grams Protein; 12 grams carbohydrate; 2 grams dietary fiber; 97 milligrams cholesterol. Reprinted with permission from Clean Eating for Busy Families: Get Meals on the Table in Minutes with Simple and Satisfying Whole-Foods Recipes You and Your Kids Will Love, by Michelle Dudash, RD (Fair Winds Press, January 2013). Michelle Dudash is a registered dietitian, Cordon Bleu-Certified chef and author of the cookbook Clean Eating for Busy Families. As a food writer, healthy recipe developer, television personality and eating coach, she has spread her message to millions of people. Follow her on Twitter, Facebook and her blog for clean eating recipes and tips.",
        "words_count": 1088
    },
    {
        "index": 4,
        "label": "Food",
        "title": "5 Reasons Why You’re Not Losing Weight",
        "body": "How frustrating is it when you just can’t lose weight? You’re trying to eat right and exercise, but the numbers on the scale don’t move. Many registered dietitian nutritionists work one-on-one with clients and have experience as to why your waistline isn’t shrinking. I asked 5 dietitians the most common reason folks don’t lose weight and you’ll be surprised by what they had to say. 1. You’re cutting too many calories “When you diet and restrict calories too low, your body’s metabolism starts to slow down, necessitating a larger caloric deficit to lose weight. Meanwhile, your hunger hormone (ghrelin) gets out of control, which simultaneously leads you to overeat,” says Abbey Sharp, RD, blogger at Abbey’s Kitchen. Instead: Sharp recommends stopping the good food, bad food mentality, and focusing on your body’s unique hunger and satiety signals. Once you stop restricting, your body will stop feeling the need to overcompensate and binge whenever it gets the chance. When you eat mindfully, you eat in response to your body’s true needs, which helps prevent episodes of overeating. 2. You’re eating too much of a healthy food “My clients often have trouble losing weight because they are consuming too much of a good thing,” claims Lauren Harris-Pincus, MS, RDN, author of The Protein-Packed Breakfast Club. “When I share that 1/5 of an avocado is one serving, people gasp.” Other good-for-you foods that are high in calories include nuts, nut butters, olive oil, and hummus. Instead: Measure portions of higher calorie good-for-you foods until you get the hand of it. See: Portion Control: Use Visual Cues to Remember Serving Sizes 3. You’re eating more than you think Oftentimes folks underestimate the amount of food and calories they are eating. They forget about the handful of nuts or half a homemade muffin they were offered by their officemate. Drinks also tend to fall off the grid, and if you’re downing specialty coffees or numerous cocktails during happy hour you’re for sure taking in hundreds of calories there. Instead: “When I first started in private practice 22 years ago, I found that without fail, my clients who consistently kept a food diary were the ones who were more successful in their weight loss efforts,” says Colleen Gerg, MA, RDN, a nutrition and mindfulness coach. Writing down everything you eat and drink creates awareness of habits and keeps you honest. See: This or That: 250 Calories of Food 4. You’re stressed out “Stress affects our eating, exercise, and sleep habits-most often in negative ways. Stress also affects our cortisol levels which makes it hard to lose weight,” declares Rebecca Clyde MS, RDN, CD owner of Nourish Nutrition. Clyde explains where “I have so many clients who are trying to be perfect at following restrictive diets who just are terrified to ‘fall off the wagon’ and stressed out about sticking to their diet.” Instead: If your diet is stressing you out, it’s time to find a better way to eat healthy and lose weight. There is no need for you to be miserable when trying to lose weight. See: It’s Not Just You: Stress and Fat Are Linked 5. You’re not getting enough sleep Most people don’t get the recommended 7-9 hours of sleep per night. “Lack of sleep can make us feel foggy headed and lethargic the next day,” explains Lauren Manganiello MS, RD, CDN owner of Lauren Manganiello Nutrition & Fitness in NYC. “Our body then craves food, especially sugar, to help combat our lack of energy. It’s very difficult to eat mindfully and listen to our hunger cues when we’re sleep deprived.” Instead: Get to bed at a decent hour and remove things keeping you awake. This means turning off the television and charging your electronic devices in a separate room so you don’t have the urge to get on them in the middle of the night. See: 4 Surprising Sleep Hacks You Haven't Heard Before Related Links: Top 10 Foods for Stress Relief Foods with 100 Calories Healthy Appetizer Recipes Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. She is the author of The Greek Yogurt Kitchen: More Than 130 Delicious, Healthy Recipes for Every Meal of the Day. *This article was written and/or reviewed by an independent registered dietitian nutritionist.",
        "words_count": 719
    },
    {
        "index": 5,
        "label": "Food",
        "title": "10 Ways To Reduce Sodium",
        "body": "Nine out of 10 Americans eat too much salt. It’s estimated that 77 percent of our salt comes from processed and restaurant foods. If your goal is to eat less salt, here are 10 simple ways to do it. #1: Use fresh or frozen vegetables instead of canned One-half cup of canned vegetables has about 15 percent of your daily sodium requirements. This is no surprise since sodium is used to preserve canned food. Instead, choose fresh or frozen vegetables whenever possible. If you’re stuck on the convenience of canned veggies, low sodium varieties are also available. #2: Make your own potato chips Chips are brimming with salt, but luckily you can make your own in a snap! My kids and chip-addicted husband loved Ellie’s Cracked Pepper Potato Chips. You can always adjust the spices to your liking. #3: Consider condiment substitutes Soy sauce, teriyaki sauce, Worcestershire sauce and other condiments are brimming with sodium. Low-sodium versions are available, you can also try adding sodium-free flavor enhancers like vinegar or citrus juices like lime, pineapple, lemon and orange.  Another option: make your own condiments like ketchup, mustard and tartar sauce. #4: Go easy on the canned spaghetti sauce One half cup of jarred tomato sauce packs in almost 25 percent of your daily dose of sodium. Most folks use double or triple that amount to coat their pasta! Instead look for “no salt added” versions or make your own tomato sauce. #5: Cook more Forgo the frozen dinners which have around 25 to 67 percent of your daily sodium recommendations. Even kid-sized frozen meals have about 34 percent of their daily recommended amounts of sodium. Lower sodium versions exist, but that doesn’t remove the laundry list of preservatives added to them. Don’t think dining out is any better- many restaurants pile on the salt. Instead, set a goal to cook more at home where you have the most control over the ingredients. #6: Replace bottled with homemade salad dressing Bottled salad dressings are a hidden source of sodium. Many are also high in sugar and fat. Lighter salad dressings exist, but many replace fat and salt with higher amounts of sugar (yuck!). Instead, make your own salad dressing in minutes. #7: Swap canned broth Do you find yourself tossing money buying tons of canned or boxed broths and stocks? Make it a weekend project to cook up a batch and freeze half to use later. Use it to flavor soup, grains, and other recipes that call for broth or stock. #8: Choose dried beans Instead of canned varieties, choose dried with virtually no sodium. If you’re a canned bean fan, then you’ll be happy to hear that a recent study showed that rinsing and draining canned beans reduced their sodium content by 41 percent! #9: Use fresh herbs and spices Resist the urge to reach for the salt shaker or spices like onion salt or garlic salt. Instead, choose fresh herbs and spices to flavor food. They’re practically sodium-free and add tons of flavor. #10: Try Juicing A cup of vegetable juice cocktail packs in almost one-third of your daily recommended amount of sodium. Instead, make your own favorite veggie juice combinations without worrying about the salt. Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. See Toby's full bio » ",
        "words_count": 561
    },
    {
        "index": 6,
        "label": "Food",
        "title": "Summer Squash and More in this Week’s CSA Box",
        "body": "This week’s CSA (community-supported agriculture) box arrived at Food Network Kitchen stuffed with fresh summer produce, and we couldn’t be more excited to start cooking! Fresh summer squash was the real star of our box, with multiple varieties making an appearance. The seasonal offering has been popping up on restaurant menus everywhere, and now, with plenty in our kitchen thanks to Mountain View Farms, we can enjoy the tender vegetable in crisp salads, cold soups and more. While unpacking our box, like many of you at home, we started to wonder what separates the pattypans from the zucchini of the world. Do they all deserve the same culinary treatment? After doing some quick research, we identified the two varietals of squash in our box as zucchini and zephyr (the two-toned one) squash. Zucchini has a habit of growing … and growing … and growing, but don’t be tempted to set any world records with your squash. The best zucchini are small, firm and have a mild taste and moderately tender flesh — just like the one in our box. To use your squash, pull out your spiralizer to make a noodle substitute, or toss it in a pan with olive for a quick saute at dinner. As for the beautiful zephyr squash, it is similar in toughness to the scalloped-edge pattypan squash, so it benefits from a longer cooking time. Use it in soups rather than salads, or roast it at a high temperature, because this summer variety will hold up under the pressure.     Here’s a peek at some of the other items in our CSA box this week:   Fresh onions: These onions, like green garlic, arrived from the farm uncured and with the woody stalk still attached. All this means is they are fresh and have a shorter shelf life (about 10 days) than the cured, papery-skinned variety you see at the grocery store. Carrots: This is a good lesson in the beauty of fresh-from-the-farm vegetables. The knobby carrots add a little character, and taste just as good as the perfectly shaped ones. Cilantro: This polarizing herb is the perfect, refreshing garnish to some, but tastes like soap to others. If you like it, add it to pestos, or chop it and use it to top guacamole or a banh mi sandwich. Red leaf lettuce: This frilly green is a fairly good source of vitamin A, but has a short shelf life of about one week — all the more incentive to start making those refreshing salads immediately upon its arrival. Cucumbers: Depending upon your CSA, you may find yourself with one cucumber or many, which can drastically change how you will use this vegetable. Just one cucumber will make a refreshing salad with a simple vinaigrette, but many means it’s time to pull out the pickling jars. Scallions: Less pungent than an onion, scallions make a crunchy addition when added raw to salads. Or, for a little tang, toss them in a stir-fry. Red cabbage: This densely packed head of cabbage makes a colorful slaw, is hearty enough to withstand braising and is the perfect way to add color to a summer DIY sauerkraut project at home. Kale: This curly kale is tougher than lacinato kale, but is still delicious. Remove the leaves from the stalk, and consider blanching your kale in salted water before sauteing if the leaves taste bitter.",
        "words_count": 563
    },
    {
        "index": 7,
        "label": "Food",
        "title": "Fresh Grocery Delivery: The Pros & Cons",
        "body": "Grocery delivery services offer point-and-click convenience and door-to-door service, but are they the smartest and safest way to buy your food? Here are some things to keep in mind before you place an order. The Basics There are several large, online grocery stores -- Fresh Direct, Pea Pod, Vons and Amazon -- that deliver to multiple states, but even some local mom-and-pop grocers offer home delivery services, too. Most of these stores offer the same generic and name brand items as you'd find on store shelves -- you’ll even find deli, produce, frozen, healthy and beauty, bulk items and cleaning products. Most also offer a wide range of kosher and organic foods and even some local options -- and many specialize in their own branded or commission special prepared meals. Typically, services charge a delivery fee and will usually give a discount for the more money you spend. There’s almost always a minimum order requirement, too ($30 for Fresh Direct and $60 for Pea Pod in my zip code). If your favorite online grocery source has a brick and mortar location (like Stop & Shop or Giant for Pea Pod), be sure to check the store to compare prices. Delivery items may be a bit more. The Good and the Bad (or Spoiled) I’ve ordered from these types of services in the past, and I’ve discovered some very distinct pros and cons. The home delivery was great, especially when I lived in a city where I had to walk and carry everything, but I did have trouble coordinating a drop-off time that worked for my schedule (they often tell you a two-hour window -- just like the cable company). Being a dietitian, food safety always pops into my mind – I was concerned about everything being fresh and whether perishable items were kept at the proper temperature in transit. My orders also came in huge boxes -- sometimes even just one small item in a larger box. That's lots of waste for me (and the environment) to deal with. In most shipments, I wasn't pleased with the produce I got -- it wasn’t fresh enough for my liking and one time, some of it was spoiled and I had to toss it (I did receive a refund after calling customer service). Based on my research and personal experience, here are some more important things to keep in mind: Pros To-your-door serviceBig orders are easier to manage for city-living -- no carrying requiredYou can keep your budget in mind as you add (or subtract) items to your online cartNutrition information and food labels for all items are available onlineTime saver: you don’t need to go to the store and you can save weekly must-haves so they're always on your list Cons The food may not always be as fresh as if you went to the store Scheduling a drop off time may be troublesomeExtra cost of delivery fees and minimum order requirementsIf a customer service problem does occur, it may take longer to work outWaste factor: lots of packaging Order Smart If you do choose to order from a delivery service, keep the following things in mind – and don’t be afraid to call and ask questions before placing your order. Call to be sure the food travels in a refrigerated truck (it’s actually mandatory by law).Make the proper arrangements for delivery if you live in an apartment building or complex -- does your door buzzer work? Can someone else sign for it immediately?Make sure someone is home to put the food away ASAP!Check your order when it arrives to make sure you got what you paid for.If you receive items that are incorrect or spoiled, call customer service right away for a refund (check the refund policy with your particular vendor).Some of the sites offer recipes and cooking instructions for things like meat and fish; definitely check them out!Here are few more FAQs from the Fresh Direct website.",
        "words_count": 658
    },
    {
        "index": 8,
        "label": "Food",
        "title": "These Diets May Not Be Safe While Pregnant or Breastfeeding",
        "body": "Millions of Americans follow a weight-loss diet each year. However, if you're pregnant or nursing a weight-loss diet may not be the best eating pattern. Getting adequate nutrients through a variety of foods is important for both mother and baby, and some elimination diets and diets with a weight loss goal can be risky during pregnancy and while breastfeeding. Here's what you need to know, and the risks of following four popular weight-loss plans during pregnancy and while nursing. Is It Safe for Women Follow a Weight-Loss Diet During Pregnancy or While Breastfeeding? \"I strongly advise against dieting during pregnancy or while postpartum and nursing,\" says Crystal Karges MS, RDN, IBCLC, Maternal Child Health Specialist at Crystal Karges Nutrition. \"A woman's overall nutrient needs to support her physical and mental health are at an all-time high during pregnancy, postpartum and while lactating. Dieting only makes it more challenging to adequately and appropriately meet these nutrient needs to sustain overall health and milk supply.\"  In addition, Karges says that women have shifting hormones and appetite levels during pregnancy and postpartum which are better stabilized with regular and consistent food intake. Fad dieting can not only negatively affect milk supply, but it can also trigger mood swings, prolong postpartum healing from childbirth, increase risk of maternal mental health conditions, and cause disordered eating. Weight-Loss Diets to Avoid While Pregnant or Nursing Let's break down the risks of four popular diets while pregnant or nursing. Intermittent Fasting There is very little research about intermittent fasting and pregnancy, and much of it has been done in animals. \"Going for prolonged periods of time without food can result in low blood sugar (glucose) in pregnant women, which stimulates a cascade of events that, over time, may affect the health of the developing baby,\" explains Elizabeth Ward, MS, RD, author, Expect the Best: Your Guide to Healthy Eating Before, During, and After Pregnancy. \"Babies require a constant source energy and a long list of nutrients to grow and develop properly, and going hours on end without eating is counterproductive during pregnancy. Given the lack of research, I don't recommend any form of IF in pregnancy.\" When nursing, women need as many calories during the first six months of breastfeeding as in the third trimester of pregnancy. After you deliver, your body is in recovery mode from nine months of pregnancy, and you shouldn't deprive it of the nutrients it needs; you need to eat for yourself and for your nursing baby. Going for very long periods of time without food can decrease your milk supply, and it can reduce the levels of omega-3 fats, choline, vitamins and minerals in breastmilk, which may affect your child's development. \"If you want to use IF to help drop pregnancy pounds, I suggest holding off until your child is at least six months old,\" says Ward. Keto Diet \"A diet based on 70% fat, 20% protein and 10% carb is lacking many nutrients crucial during pregnancy,” says Sarah Krieger, MPH, RDN. In addition, Ward says \"animal studies suggest that the keto diet during pregnancy limits baby's growth\" and explains that women following the keto diet to the letter are producing ketones as energy source, and nobody really knows the effects that could have during pregnancy and breastfeeding. The keto diet is very high in saturated fat, which is not recommended for any stage of life, including pregnancy and nursing. Paleo Diet A Paleo diet typically includes only lean meats, fish, fruits, vegetables, nuts and seeds and eliminates grains, dairy, and legumes. Ward says, \"We don't live in the Stone Age, and we know that grains, dairy and legumes are nutritious foods that mom and baby benefit from.\" A Paleo diet is not a good idea during pregnancy or breastfeeding, given that avoiding certain foods or food groups can rob the baby of important nutrients, including phytonutrients, calcium and vitamin D. Calorie-Counting Diets Karges says that she wouldn't recommend any calorie-counting diets or diets based on points for pregnant or lactating women. \"Any weight loss plan that has you counting calories or points in a very specific way is going to deter you from responding to your body's individual needs. In the case of pregnant and lactating women, this is especially dangerous, as their needs are usually much higher than what's allotted in these restrictive eating diets,\" says Karges. During pregnancy and new motherhood, eating by external rules, rather than responding to internal body cues, can make food chaotic and confusing making it difficult for a woman to actually be present in her life and to have the mental energy to focus on the things that matter most. This could be conflicting for any woman trying to navigate new motherhood. What If You Still Want to Diet While Pregnant or Nursing? Working with your doctor and a registered dietitian is important for pregnant women and new moms interested in following a specific diet during this stage of their lives. Krieger says that working with a registered dietitian \"is key to determine what is the best diet (or way of eating) that will help her reach her nutrition goals.\" It’s important for moms to remember that the ultimate goal is a healthy full-term baby and mother. Post-partum weight loss is more obtainable even when calorie needs are increased. \"I know moms want to lose weight quickly, but it’s best to continue to eat mostly the same way while pregnant: a balanced diet with vegetables, lean protein, monounsaturated fats, whole grain options and fruits,\" explains Krieger. Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. She is the author of The Greek Yogurt Kitchen: More Than 130 Delicious, Healthy Recipes for Every Meal of the Day. *This article was written and/or reviewed by an independent registered dietitian nutritionist. Related Links: For the Love of Food Safety: Stop Washing Your Chicken How to Wash Your Hands How to Use Hand Sanitizer",
        "words_count": 997
    },
    {
        "index": 9,
        "label": "Food",
        "title": "How to Make Oat Milk",
        "body": "By Fraya Berg for Food Network Kitchen Fraya is a chef and a contributing writer at Food Network. Oat milk is one of the best plant-based milks you can find. It’s great for baking, making ice cream or adding to a cup of coffee. But if you're an oat milk drinker, you know the store-bought stuff can cost a pretty penny. DIY-ing saves money and is also a fun project. Read on for step-by-step instructions, plus answers to your most common questions. What Does Oat Milk Taste Like? Oat milk has a fairly creamy texture, similar to that of dairy milk. The flavor is also like that of milk, with a pleasant sweetness, creaminess, toasty-ness and distinct oat flavor. We'd venture to say that oat milk more closely resembles the mouth feel and flavor of dairy milk than any other milk alternative. How to Make Oat Milk Step-by-Step Following these simple steps will lead you to a container of oat milk in your fridge that you can use in just about any recipe that calls for cow milk. 1: Soak the Oats Measure 1 cup rolled oats into a medium bowl. Add enough cold water to cover by 1 inch. Refrigerate for 6 hours or overnight, until the oats are softened. 2: Rinse the Oats Transfer the oats to a strainer and thoroughly rinse them under running water. 3: Blend the Oats Place the rinsed oats and 3 cups cold water in a blender and blend on high until the oats are pulverized, 30 seconds to 1 minute. 4: Strain the Oats Place a clean linen towel inside a fine mesh strainer and place it over a large container. Pour the oat mixture into the strainer. Transfer the strainer and bowl to the refrigerator; gravity will strain the milk through. 5: Flavor Oats When strained, if you desire, whisk in a sweetener like maple syrup. Then add vanilla and a pinch of salt. 6: Store the Oat Milk Store the oat milk in a covered container in the refrigerator for 2 to 4 days, shaking before using. How do You Stop Oat Milk from Being Slimy? No one wants slimy oat milk. Luckily, there are a few things you can do to ensure yours isn't. Use only rolled oats. Quick oats will increase the viscosity (the fancy word for slime).Blend with ice water. Use ice-cold water in the blender when you’re blending the oat milk.Blend on high speed. The less time you have the blender running to pulverize the oats, the better. Getting to high speed as quickly as possible is your best bet.Let the oats strain with gravity. Don’t squeeze the oats to make the straining go faster—let gravity do the work.Strain a second time. After following the directions and straining once after blending, strain the oat milk again if you're worried about sliminess. How Long Does Oat Milk Last? The oat milk you make at home will be good for 2 to 4 days in the fridge. Store-bought oat milk has stabilizers that give it a longer shelf life. Like dairy milk, oat milk should be stored in the coldest part of the fridge, not on the door. Be sure it's covered, and shake before using. Oat Milk Calories On average, an 8-fluid ounce serving of oat milk that you buy at the store contains 130 calories and 5 grams of fat. Since oats are naturally low in fat, much of the fat in oat milk comes from oils added to the mixture to help stabilize and thicken the end product. When you make your own, there will be fewer calories and almost no fat. We have lots more info on oat milk nutrition in this article: Is Oat Milk Healthy?. Is Oat Milk Gluten-Free? The purest oats are gluten-free, but you need to check the label. Oats processed in machinery that may have been used for other grains might have traces gluten. Always look for a label that clearly states \"gluten-free\" when you are buying oats for making oat milk at home and when buying oat milk in the dairy aisle. How to Use Oat Milk You can use oat milk in place of cow milk in almost any recipe you’ll be making: smoothies, cookies, muffins, macaroni and cheese and so many more dishes. Drink it straight up out of a glass. Let’s start with the easy answer: you can pour oat milk into a glass and sip it just like regular milk because it's tasty and goes well with a chocolate chip cookie or a slice of cake. Add it to coffee. A classic pairing? Iced coffee and oat milk. Many people also love oat milk lattes. Use it in baking. Oat milk is widely recognized by recipe developers and pastry chefs as an excellent cow-milk substitute when baking. Most store-bought oat milk has some fat added to create creaminess so it’s better as a substitute than homemade oat milk. Look for containers labeled “full-fat”. Turn it into ice cream. Oat milk can be frozen as ice cream using an ice cream machine or without one (for details on the different ways you can make ice cream without a machine, head over to our story How to Make Ice Cream without an Ice Cream Maker). Just like with baking, store-bought oat milk delivers a better outcome for ice cream because of the added fat. For the creaminess of ice cream, some vegan recipes use nut butters. Other recipes use egg yolks and you make a custard just like dairy ice cream. Recipes with Oat Milk  Oat Milk and Oatmeal Cookie Ice Cream Sandwiches First you make the no-churn oat milk ice cream; while it’s freezing, you bake the oatmeal cookies. The final combo evokes the childhood combo, cookies and milk, no dunking necessary. Oat Milk Pumpkin Pie with Oatmeal Cookie Crust Oat milk makes for silky, flavorful pumpkin pie filling - and the flavor is tied in with a oatmeal cookie crust and mini oatmeal cookies on top. Vegan Oat Milk French Toast Mixing oat milk with flaxseed meal and cornstarch makes a perfect batter for dipping toast in. The results are fluffy and custardy. Maple syrup, blueberry syrup, cinnamon sugar—take your pick when looking for a topping. Maple Oat Milk Cold Brew This recipe walks you through making cardamom cold brew coffee as well as fast from-scratch oat milk. Chocolate Oat Milk Unsweetened cocoa powder transforms oat milk into tasty chocolate milk. Related Links: Vegan Recipes That Don't Skimp on Flavor Healthy Vegetarian Recipes Our Best No-Bake Desserts",
        "words_count": 1093
    },
    {
        "index": 10,
        "label": "Food",
        "title": "Salad of the Month: Valentine's Day Pink and Red Salad",
        "body": "Chocolate and sweets are the usual Valentine's Day foods, but it's also possible to take a savory approach to mark the day, especially if you play with color. Here, the familiar rich red and pink tones of the holiday come through from the vegetables, which get an exotic deep purple background of black rice plus a snowy-white dab of goat cheese. Black rice cooks up surprisingly light and fluffy, absorbs any flavors easily and goes well with just about anything you add to it. I use white balsamic vinegar here to give the rice a touch of sweetness that pairs beautifully with the tangy fresh goat cheese, bright pickled radishes and slight bitterness of the deep red leaves of treviso. The salad may sound like a few too many steps to consider making on a weeknight, but believe me, once the pickles are made and the rice is cooked, it's a simple assembly with striking results sure to impress. Valentine's Day Pink and Red Salad Serves 2 For the best pink color, pickle the radishes the day before you want to serve the salad. Both the black rice and the pickled radishes will make more than you'll need for 2 servings, but the pickles keep weeks (in the fridge) and the black rice can be stored in the fridge for 3 to 4 days. Note: If you forget to soak the rice, increase the cooking water to 1¼ cups. For the pickled radishes:     8 medium red radishes       ¼ cup apple cider vinegar       ½ teaspoon sea salt   For the forbidden black rice:     ½ cup forbidden black rice, soaked overnight in 2 cups water       ¾ cup water       Pinch sea salt   For the salad:     4 teaspoons extra virgin olive oil       4 teaspoons white balsamic vinegar       Sea salt       2 teaspoons chopped chives       4 to 6 treviso leaves       2 oz fresh goat cheese       Chopped chives       Radish sprouts   Make the pickles: Cut radishes into 8 wedges and place in a medium bowl. Add apple cider vinegar and salt, and toss to combine. Set aside for a few hours, stirring every now and then to give them an even color. Transfer to a jar and place in the fridge overnight, or up to 2 weeks. Make the rice: Drain and rinse the rice. Place in a small pot and add water and a pinch of salt. Bring to a boil over high heat, cover pot, reduce heat to low and simmer for 50 to 60 minutes or until all the water is absorbed. Remove from heat and allow to sit for 10 to 15 minutes before removing lid and fluffing with a fork. Make the salad: Place 1 cup of cooked rice (warm or room temperature) in a medium bowl and add olive oil, vinegar, a pinch of salt and chives. Toss to combine and add more salt to taste. Arrange treviso leaves into 2 bowls and top with ½ cup of rice each. Divide cheese between bowls and scatter about 6 pieces of pickled radishes over each salad. Sprinkle with chives and sprouts. Photo by Stephen Johnson Amy Chaplin is a chef and recipe developer in New York City. Her cookbook At Home in the Whole Food Kitchen will be available fall 2014. She blogs at Coconut & Quinoa.",
        "words_count": 543
    },
    {
        "index": 11,
        "label": "Food",
        "title": "How Often Should You Eat?",
        "body": "    Many experts recommend eating small meals frequently throughout the day. However, a new school of thought has emerged that recommends eating larger, less frequent meals. So how often should you be eating?   Eating Smaller, Frequent Meals The Theory: Nutrition experts tend to recommend eating 3 balanced meals (350 to 600 calories each) and 1 to 3 snacks per day (between 150 and 200 calories each). The calories for each meal and snack depend on a variety of factors including, height, weight, age, gender and activity level. The philosophy is to make sure you don't go longer than 5 hours or so without eating. After going without food for a prolonged period of time, folks tend to become ravenous and their decision-making skills plummet. They end up choosing any food they can find, including fast food or high-calorie treats. Pros: Having a small, healthy snack between meals (like cut veggies and hummus or half a PB&J on whole-wheat bread) can curb hunger until the next meal and enable people to make sensible food choices. Cons: One big issue I've seen with clients is that they tend to overdose on snacks: Instead of having 150 to 200 calories, they end up munching on closer to 400 to 500. In addition, foods chosen for snacks should provide good-for-you nutrients the body deserves; higher calorie snacks (like cookies, cakes, sugary drinks) tend to be empty of nutritional value. Eating Larger, Less Frequent Meals The Theory: The other school of thought is to eat one or two larger meals a day, which gives people less of an opportunity to graze on extra calories throughout the day. Pros: A recent study presented at the 2013 American Diabetes Association conference found that, compared with folks who ate 6 smaller meals daily, study participants who ate 2 large meals per day (breakfast and lunch) lost more weight, even though both groups consumed the same number of calories. All of the subjects in the study had type 2 diabetes. Cons: It should be noted that this study only had 54 participants, which is a very small sample size. In addition, experts not involved in this study have commented that skipping dinner isn't feasible since it's the one meal most folks have time for. Furthermore, skipping meals isn’t a good idea for diabetics, as the amount of glucose (aka sugar) they get from food should be evenly distributed throughout the day. Another downside to this way of eating is that most people may not be able to take in all of their essential nutrients in one or two sittings, especially since several vitamins and minerals negate each other in the body. (For example, iron is less likely to be absorbed when high amounts of calcium are around.) Studies have also shown negative consequences of eating larger, less frequent meals. One 2007 study published in the journal Metabolism looked at folks who ate one big meal as opposed to 3. They tended to eat as many calories in that one meal as in 3 smaller meals. And researchers found that eating one meal resulted in potentially dangerous metabolic consequences. Folks who skipped meals had higher blood sugar levels and a delayed insulin response—these are two conditions that can lead to diabetes if they continue over a long period of time. Finally, a 2010 study published in the British Journal of Nutrition found that when subjects ate 3 meals and 3 snacks versus 3 meals per day (while eating the same amount of calories), the rate of weight loss was not greater with either type of eating pattern. Bottom Line: Stick to eating smaller, frequent meals as opposed to eating one or two larger ones. However, that doesn’t give you free rein to eat whatever you want. Calories still need to be kept in check and food choices should be well balanced from all the food groups. Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. See Toby's full bio » ",
        "words_count": 669
    },
    {
        "index": 12,
        "label": "Food",
        "title": "Is Over-Dieting Ruining Your Workout Goals?",
        "body": "You may have heard that diet outweighs exercise when it comes to weight loss, but what happens when you go ham on reducing calories while upping it in the gym? I mean new year, new you, right? Think again. According to experts, over-dieting can be detrimental to goal-crushing while putting you at risk of being sidelined from “getting after it” altogether. “Your relationship with food can directly affect your ability to exercise — from reduced performance and endurance to minimized results,” says Elizabeth Kehoe, RDN, LDN, non-diet dietitian and co-founder of EKG Nutrition. “All too often, food is viewed as the antithesis to exercise since we have come to believe you must burn off all the calories you eat to lose weight and perform at your best.” Spoiler alert: You need food to work out in the first place. “The food you eat provides the energy (in the form of calories) your body needs to perform at its best,” explains Kehoe. “Carbohydrates are your body’s preferred source of energy for exercise, so eating enough calories — particularly as carbohydrates — can improve performance and give you the energy you need to push through a workout.” “Dieting can cause more problems than a few extra pounds would,” adds sports dietician and certified intuitive eating counselor Cindy Dallow, PhD, RD. For example, while many dieters may still able to work out, cutting calories too much can lead to fatigue — limiting the level of intensity required to create a strong, lean body composition. In short, lacking the tenacity in the gym — instead, simply going through the motions — doesn’t and will not equate to the physical transformation you’re looking for in the mirror. Cutting too many calories come mealtime can also create a domino effect — increasing soreness and the risk for injury. “If a person is not getting the calories they need, then they will not utilize protein for muscle-building,” explains Dallow. Instead, the protein will be used to meet energy demands. As you can imagine, the impact of over-dieting goes far beyond skin deep. “Over-dieting causes caloric and nutrient deficits, putting you at risk for low blood pressure, bone fractures, lightheadedness, nutrient deficiencies and more,” says Kehoe. Poor sleep, moodiness and anxiety are also noteworthy implications. “All too often, we see clients who are aiming to lose weight by limiting calories and exercising to extremes, only to be frustrated when their weight plateaus,” says Kehoe. “It may sound counter-intuitive, but your body needs those calories to burn them. Without adequate calories, your body will go into starvation mode and hold onto each calorie you eat, causing your weight to remain stable.” So how do you know if you’ve taken things too far? Listening to your how you feel during your workouts can keep you in check. Oh, and if you’re thinking of food all of the time? It’s probably your body’s way of telling you to up your portion sizes. Lauren Seib is a pug mom, personal trainer, online coach and group fitness instructor based in Stamford, Conn. Her credentials include NASM CPT, Spinning(R), RYT 200 and Barre by exhale. Related Links: The Best Healthy Cookbooks of 2018 10 Foods You Should Be Eating More Of Healthy Dinners in 40 Minutes or Less",
        "words_count": 544
    },
    {
        "index": 13,
        "label": "Food",
        "title": "The Energy Chef: Game-Time Snacks",
        "body": "Football season is well under way, and when I'm not tailgating at the game, I love to invite friends over to watch my favorite teams play. Football and snacks go hand in hand, but it's easy to overdo it on chips, pizza and popcorn.  Don't let your diet get tackled by high-calorie, fatty snacks. Try my lighter takes on favorite football foods. Chips and Dip, Lightened Up When I’m snacking, it's all about the crispiness of the chip combined with a change in texture when I dip it into a creamy, flavorful sauce. You can easily consume 500  to 700 calories of chips and dip in less than an hour, and if other snacks are in play, it's easy to hit the 1,000 calorie mark before halftime. So how do you lighten it up? Start with the chips.  Instead of typical tortilla or potato chips, make your own out of vitamin-rich yucca, a root commonly found in tropical environs. I pair the chips with guacamole, but a lightened-up artichoke dip or hummus would also be delicious. Cilantro Lime Yucca Chips With Guacamole(pictured above) Yield: 12 Servings   Ingredients:     1 large yucca root, peeled and sliced 1/8 inch thick       2 tablespoon olive oil       1 bunch cilantro, chopped       Juice of 3 limes, divided       3 medium avocados, diced       Salt and pepper to taste   Directions:  In a large bowl, toss yucca, olive oil, half of the cilantro and the juice of one lime. Season chips with salt and pepper. Coat a baking sheet with nonstick spray, then lay yucca slices flat on a baking sheet. Bake for 4 to 6 minutes per side, or until golden brown. For the Guacamole: In a medium bowl, mix diced avocado with remaining cilantro and lime juice; season with salt and pepper and mash to your favorite consistency -- I like mine chunky. Save those avocado shells to use as a serving \"bowl.\" Nutrition Info Per Serving     Calories: 115       Total Fat: 8 grams       Saturated Fat:  1 gram       Total Carbohydrate:  12 grams       Protein: 1 gram       Sodium:  107 milligrams       Cholesterol:  0 milligrams       Fiber: 3 grams   A Better Slice of Pizza I love pizza and can easily polish off a whole pie, but that’s definitely not the best thing for your waistline, or any other part of your body. What’s better with pizza than beer? But before grabbing a cold one, work up a thirst throwing the football around.  Then, have a big glass of water -- you'll feel fuller and won't be as tempted to overindulge. Instead of greasy delivery pizza, make your own, fast, with a whole-wheat flour tortilla. The best part? You control the toppings. Top tortillas with your favorite veggies and just enough cheese to make it gooey and delicious -- I use a mixture of goat cheese and mozzarella.  Plus, it takes less than 10 minutes in the oven. Beat that, delivery guy! Veggie Tortilla Pizza Yield: 10 servings   Ingredients:      1 tablespoon olive oil       1 medium zucchini, finely chopped       1 medium yellow squash, finely chopped       2 cloves garlic, minced       1/2 medium onion, finely chopped       1 package (10 count) low-carb whole wheat tortillas       3 ounces herbed goat cheese (optional)       1/2 cup shredded low-fat mozzarella       1 bunch fresh basil, chopped       Salt and pepper to taste   Directions: Preheat oven to 375 degrees F. In a medium saute pan, heat oil, add veggies, garlic, salt and pepper and cook until just softened, about 6 to 8 minutes. Lay tortillas on a baking sheet and top each one with veggies, cheese and fresh basil. Bake for 8 to 10 minutes, or until cheese is melted. Nutrition Info Per Serving (1 tortilla pizza):     Calories: 155       Total Fat: 7  grams       Saturated Fat: 3 grams       Total Carbohydrate: 15 grams       Protein: 8 grams       Sodium: 404 milligrams       Cholesterol: 11 milligrams       Fiber: 9 grams   Popcorn: Salty, Sweet and Slimmed It’s fall, and who doesn’t love the flavor of good, old-fashioned kettle corn? I make my version with agave nectar instead of traditional white sugar, and I pop the popcorn on the stovetop with just enough canola oil. Agave Kettle Corn Yield: 12 servings   Ingredients:      1/2 cup popcorn kernels       2 tablespoons canola oil       3 tablespoons agave nectar       1/2 teaspoon cinnamon       Salt   Directions: Pour canola oil and 2-3 kernels popcorn into a large sized pot with tight fitting lid. Place over high heat on stovetop. When the 2-3 kernels pop, pour in the remaining kernels and move pan around over heat until all of the popcorn has popped. In a small bowl, mix agave nectar, cinnamon and salt. Pour mixture over popcorn in pan and toss with hands or wooden spoon. Lay popcorn out on baking sheet and bake in a preheated 375-degree oven for 10 minutes. Nutrition Info Per Serving (1 cup each):       Calories: 71       Total Fat: 3 grams       Saturated Fat: 0 gram       Total Carbohydrate: 11 grams       Protein: 1 gram       Sodium: 194 milligrams       Cholesterol: 0 milligrams       Fiber: 1 gram   Don't forget to have a little fun at halftime: Grab a pigskin and play a little two-hand touch football with your friends and kids to burn off some of those snacking calories.  When halftime is over, you can go back to watching...and eating! Next Food Network Star season 6 finalist Herb Mesa is a restaurant-trained chef, a self-taught healthy cuisine chef and a certified personal trainer. Herb teaches ‘balance through food and fitness’, and works as a personal chef and trainer in Atlanta. You Might Also Like: Herb's Lighter Tailgate RecipesNachos, Lightened UpBetter School Lunch: Herb's Lunchbox Makeover ",
        "words_count": 908
    },
    {
        "index": 14,
        "label": "Food",
        "title": "What Are Scallions?",
        "body": "By Layla Khoury-Hanold for Food Network Kitchen Layla Khoury-Hanold is a contributor at Food Network. You’ve likely seen scallions—with their small white bulbs, short off-white roots and long green stalks—lining produce displays at farmers markets and grocery stores. You might recognize the name from namesake dishes like scallion pancakes, or as the unnamed garnish that brings a pop of green and mild oniony flavor to dishes such as loaded baked potatoes or stir fries. But what exactly are scallions? Here, we share answers to all your burning scallion questions, including how to cut, store and use them, plus some of our favorite scallion recipes. What Are Scallions? Scallions, also known as green onions, are a member of the allium family, which also includes onions, leeks, shallots and garlic. They are harvested early before the onion bulb fully forms, so they have a small, white base with straight sides. In addition, they have long, slender green stalks that progress from light green to dark green. Both the white and green parts are used in a variety of culinary applications and can be consumed raw or cooked. Scallions are available year-round, though their peak season is spring and summer. Scallions are sometimes mistakenly called spring onions, but they are not the same thing—spring onions have a larger, more bulbous white base. What Do Scallions Taste Like? Both the white and green parts of scallions are edible, though their flavors are different. The white part has a more intense onion taste than the green parts, but overall, it’s still milder in flavor than fully mature onions and palatable when eaten raw. The green parts have an even milder onion flavor with distinct fresh, grassy characteristics. Green Onions vs. Scallions Green onions and scallions are the same thing, though you might see them labelled differently at the grocery store or market. They can be used interchangeably in recipes, whether used raw as a garnish or cooked by roasting, grilling or sautéing. Chives vs. Scallions Although they both have a mild onion flavor, chives and scallions are not the same thing. Chives come from a different plant species than scallions and green onions. They are considered part of the herb family, alongside other herbs such as parsley and basil. In addition, chives are thinner, more delicate and have an even milder onion taste than scallions. How to Cut Scallions Scallions are easy to prep with some basic knife skills and a delicate touch. First, trim off the root end of the scallion (the part with the short root threads sticking out) as close to the base as possible. Next, cut to separate the white and light green part from the darker green leaves. Slice the scallions thin, on the bias, or into pieces as called for in your recipe. Avoid pressing down too hard or you risk bruising the stalks, especially the more delicate, darker green leaves. If you’re slicing multiple scallions at once, lay them flat in single file to avoid bruising. How to Use Scallions Scallions are a versatile ingredient that can be used in a range of cuisines, either whole or chopped, or lightly cooked or raw. Raw, thinly sliced scallions are a commonly used garnish in Asian and Latin-American dishes, as with this Spicy Shrimp, Celery, and Cashew Stir-fry (pictured above) and this Instant Pot Chicken Adobo. They can also be used to finish different types of soup, like this hearty Moroccan Meatball Soup or a light Miso Soup. A garnish of scallions can also add a punch of oniony freshness that helps cut through the richness of comfort food dishes, such as this creamy One-Pot Cajun Chicken Pasta or this Loaded Baked Potato Casserole. Scallions add an aromatic pop of allium flavor to amp up condiments, dips and dressings. Try this Scallion Sour Cream as a base for chip dip or as a taco or baked potato topping. Serve Miso Scallion Tofu Dip with a platter of crudité at your next potluck picnic. Pair Scallion Bacon Ketchup with burgers, meatloaf or roast potatoes for a new twist on old standbys. Scallions benefit from light cooking applications to retain some of their signature crispness and freshness. They can be sauteed with noodles or rice, as with this Pork and Noodle Stir-Fry or this fan-favorite Cajun Shrimp and Rice dish. Try grilling scallions and using them to bolster meaty mains like this Hoisin Burger, or try folding ‘em into sides, like this barbecue-ready Grilled Scallion Potato Salad. A trip under the broiler adds a nice char to scallions before they’re chopped and added to salsa, like this roasted tomato scallion relish, which makes a fine accompaniment to roast chicken. How to Store Scallions Depending on how long you need to keep your scallions fresh, there are a few different storage methods to employ. To Keep Scallions Up to Three Days: Store In a Damp Paper Towel In the Refrigerator If you’re planning to use your scallions within a few days of purchase, store them wrapped in a damp paper towel in the fridge. Remove any packaging, rinse the scallions and pat dry with paper towels. Squeeze the paper towels to remove any excess water—the dampness offers necessary humidity for optimal storage conditions, but if the towel is too wet, it can cause rotting. Wrap scallions in the damp paper towel and store in your refrigerator’s crisper drawer for up to three days. If the paper towel dries out, re-moisten it; if it becomes too wet, replace with a fresh, damp paper towel. To Keep Scallions Up to a Week: Store In a Jar Put scallions root-side down in a clean, sturdy glass jar that’s tall enough to hold the scallions upright (without them flopping over the edge). Fill the jar with just enough cold or room temperature water to cover the roots, about 1 to 2 inches. Place on your kitchen windowsill and change or add water every couple of days, as needed. This will keep your scallions fresh for up to a week; they may also continue to grow stored this way. If you don’t have a windowsill in your kitchen, you can store them in a jar in the refrigerator. Follow the instructions above, then cover the scallion tops with a plastic produce bag and secure the bag with a rubber band around the mouth of the jar. Alternatively, you can use a Ziploc bag and seal the sides a little (you don’t need an airtight seal, just enough closure to trap the humidity). Store in the refrigerator (away from heavily trafficked areas to avoid knocking the jar over) for up to 1 week, changing the water every couple of days or so. Scallions Recipes Grilled Scallions Scallions are trimmed at the root end, then brushed with olive oil and grilled whole. Serve them as is to accompany other grilled fare such as steaks or fish, or give them a rough chop to punch up marinades, dressings, salsas or salads. Spicy Cilantro-Scallion Salad Both the white and green parts of scallions take a starring turn in this zesty salad. The white parts are quartered lengthwise, then soaked in cold water to remove some of the raw onion bite. They’re then tossed with the thinly sliced green parts of the scallions in a garlicky rice-vinegar-chili-oil dressing and combined with serrano chiles and thin strips of cucumber. Scallion Pancakes Scallions are called for two ways in this classic dish. First, finely chopped scallions add mild onion flavor and flecks of green color to the cooked savory pancakes. Then, raw sliced scallions are added to punch up the savory sesame-soy dipping sauce with a burst of freshness. Chicken and Broccoli Stir Fry In this fan-favorite recipe, the thinly sliced white parts of scallions are sauteed with chicken and broccoli to lend a slightly sweet, mild onion flavor to a classic stir fry. Though the recipe doesn’t call for it, you can opt to thinly slice the scallions’ green parts and use them as a garnish. Roast Chicken with Spring Vegetables Scallions are at their peak in spring and summer, so it makes sense to showcase them with other spring veggies such as radishes, carrots and new potatoes. When cut into thirds, they’re just the right size to roast until tender alongside the other vegetables and a golden-crisp roast chicken. Related Links: Mouthwatering Grilled Main Dishes Delicious Vegetable Side Dishes 10 Shockingly Grill-Friendly Vegetables",
        "words_count": 1400
    },
    {
        "index": 15,
        "label": "Food",
        "title": "The Chef's Take: Vegetarian Meatballs from Daniel Holzman",
        "body": "\"Vegetarians want the vegetarian option not to feel like an afterthought,\" says Daniel Holzman. \"And so the question was how can we celebrate vegetables and make something really delicious.\" This question was particularly perplexing to chef Holzman, who, in 2010, along with his partner Michael Chernow, opened a restaurant called The Meatball Shop on Manhattan's Lower East Side. The plan, as you can imagine, was to specialize in meatballs. \"We wanted to include a vegetarian meatball to be as inclusive as possible,\" Holzman explains. Their solution to the vegetarian meatball conundrum came in the form of this recipe, a green lentil meatball, which Holzman is partial to serving with a basil-spinach pesto, one of five sauces guests can choose from at each of the Meatball Shop locations (a sixth shop is opening this summer on New York City's Upper West Side). In developing this particular meatball recipe, Holzman says, he knew what he was after from the get-go. \"I wanted something satisfying and filling that reminded you of home and the past. I wanted flavors you can understand. In the end,\" he says, \"the method for making this is like making a really hearty lentil soup.\" The addition of breadcrumbs, Parmesan and walnuts helps bind the mixture. Over time, this dish has become the menu item Holzman, who is not a vegetarian, eats most often. \"I’m a chef, so I struggle with healthy eating and exercise in my life. I always have an occasion to celebrate and there is always an excuse to over-indulge. I'm lucky because this recipe is comforting and healthy,\" he says, \"so I end up eating these meatballs like six days a week.\" Vegetarian Meatballs Makes about 24 golf-ball-size meatballs     2 cups green lentils       2 carrots, chopped (about 1 cup)       1 large onion, chopped (about 2 cups)       2 stalks celery, minced (about 1 cup)       1 clove garlic, minced       4 sprigs thyme, picked (about 1 tablespoon)       2 teaspoons salt       ¼ cup plus 2 tablespoons olive oil       3 tablespoons tomato paste       ½ pound button mushrooms, sliced (about 3 cups)       ½ bunch parsley, chopped (about ½ cup)       ½ cup breadcrumbs       3 eggs       ½ cup Parmesan cheese, grated       ¼ cup chopped walnuts       Basil-Spinach Pesto, for serving (see recipe below)   Preheat the oven to 400 degrees F. In a medium pot, add lentils and 2 quarts water. Set pot over high heat and bring water to a boil. Reduce heat to low and simmer lentils until soft but not falling apart, about 25 minutes. Pour cooked lentils through a colander and let cool. In a large frying pan set over a medium-high heat, saute carrots, onion, celery, garlic, thyme and salt with ¼ cup of olive oil until vegetables soften, about 10 minutes. When vegetables are tender and begin to brown, stir in tomato paste. Cook, stirring constantly, until paste darkens, about 3 minutes. Stir in mushrooms and saute, stirring frequently, until completely cooked and browned on edges, about 15 minutes. Remove vegetables from frying pan and set aside to cool. In a large mixing bowl, combine cooled vegetables with lentils and all remaining ingredients, save for the 2 tablespoons olive oil and the pesto. Mix until well combined. Place mixture in refrigerator to cool completely, about 25 minutes. Drizzle remaining olive oil into a large 9-by-12 baking dish, making sure to evenly coat. Roll lentil mixture into round, golf-ball-size meatballs, making sure to pack the balls firmly. Place lentil balls into the oiled baking dish, making sure none of the meatballs touch one another. Roast lentil balls until firm and cooked through, about 30 minutes. Allow the meatballs to cool for five minutes before removing from the tray. Serve with pesto. Spinach-Basil Pesto Makes 4 cups     1/8 cup walnuts       4 cups baby spinach leaves       2 cups basil leaves       1 teaspoon salt       ½ cup olive oil       1/8 cup grated Parmesan   Preheat the oven to 350 degrees F. Spread walnuts out on a 9-by-13 baking dish and roast until golden brown, about 12 minutes. Set nuts aside to cool. Fill a large stock pot three-quarters of the way full with water and bring to a rolling boil over a high heat. Next, fill a large bowl with ice water. Drop spinach and basil into boiling water and give leaves a stir. After 1 minute, remove greens and plunge them into ice water. Discard boiling water Once cool, remove greens from ice bath and squeeze them dry. Give them a rough chop and transfer to a food processor. Add all remaining ingredients to the food processor and blend until an uniform, pesto-like consistency is reached. Kitty Greenwald is a Brooklyn-based food writer and recipe developer. She eats a lot for work and pleasure. Her column Slow Food Fast appears in the Wall Street Journal.",
        "words_count": 791
    }
]