[
    {
        "index": 1,
        "label": "Food",
        "title": "Now Trending: Smoothie-Delivery Programs",
        "body": "The popularity of home-delivery cooking services continues to grow. Think beyond meal programs: Now smoothie and juice lovers can get in on the action. We took a few of the most-popular options for a whirl in our blenders. Smoothie Nutrition Smoothies can be healthy eats, but you do have to be mindful of the ingredients and the portion sizes; even too much healthy food can lead to an excess of calories. The smoothies we tried contained anywhere from 40 to 200 calories per serving and varied significantly in totals for healthy fat, fiber and carbohydrate, depending on the ingredients. Since most smoothies are made with nothing but whole foods, added sugars weren’t really a concern. Ordering, Pricing and Delivery Placing orders is super-easy. Brands like Green Blender and Daily Harvest have very user-friendly websites that will get smoothies to your door with just a few clicks. Prices range from about $7 to $9 per smoothie ($3.50 to $4.50 per serving) depending on which plan you select. There were some significant differences between these brands, so do some research before deciding which is the best fit for your lifestyle. Green Blender, much like many popular meal-deliver programs, comes with all ingredients individually wrapped and labeled. Produce requires a wash before use, and your shipment includes a bundle of packets featuring add-ins like pea protein powder, wheatgrass, cinnamon, dried fruit and chopped nuts. All this fresh food is certainly desirable, but it does require some extra elbow grease to prep and store for the week. Daily Harvest smoothies arrive in premeasured frozen cups that are packed in dry ice. Just open and add to the blender with water or other recommended liquid (not included). The container can then serve double duty as a cup, which you can pour your prepared smoothie back into (clever). Fresh Flavors Green Blender’s kit includes recipe sheets for each smoothie, as well as a guide with useful tips for perfect blending. The a la carte ingredients allow users to omit certain elements if desired. We loved the fresh ingredients and unique flavor combos. Some of the best flavors we tried were Goji Cranberry Crimson (pictured below), made with acai berry and mandarin orange, and Persimmon Pineapple Protein, featuring yellow squash and flaxseed. Daily Harvest suggests a variety of liquids — including water, coconut water and almond milk — to mix with the frozen ingredients. The Matcha Colada (left) with kale, lime and vanilla was tremendous blended with coconut water, and the Cacao Kapow (right) with avocado and pink Himalayan sea salt was creamy and plenty chocolatey blended with almond milk. The fast preparation is delightfully mindless, and while you can choose your favorite liquid, you don't have the flexibility to omit an ingredient. But you can choose exactly which smoothies you want each delivery cycle, which isn't the case with some other programs. Dana Angelo White, MS, RD, ATC, is a registered dietitian, certified athletic trainer and owner of Dana White Nutrition, Inc., which specializes in culinary and sports nutrition.",
        "words_count": 503
    },
    {
        "index": 2,
        "label": "Food",
        "title": "Scalloped Potatoes with Blue Cheese and Mushrooms",
        "body": "Layer after layer of warm cheesy potatoes — it’s pretty much a classic definition for comfort food. Here, buttery yellow-skinned potatoes and thickly sliced mushrooms are drenched in a 10-minute cream sauce and sprinkled with rich blue cheese. In past decades, scalloped potatoes were on the dinner rotation with other casseroles. But these Scalloped Potatoes with Blue Cheese and Mushrooms have been updated for modern tastes, and they feature a few tricks that make them lighter than the cream-drenched \"covered dishes\" of the past. Here’s what I stirred up: Yukon Gold Potatoes These thin-skinned potatoes taste buttery even without the addition of any dairy. Leaving the skins on ups the flavor and nutrition. Blue Cheese Your grandma probably didn’t add blue cheese to her hot dish; using this umami-rich cheese packs intense flavor throughout the recipe, with the use of only a half-cup of cheese. Baby Bella Mushrooms Also known as \"cremini,\" these meaty mushrooms are sliced thick to give them solid structure, making the scalloped potatoes hearty enough to serve as a meatless meal. Also, mushrooms contain vitamin D, which may help improve your mood as daytime sunshine becomes sparse. Lastly, this updated casserole is served in a cast-iron skillet — a nod to \"what’s old is new again.\" You could also use a large oven-safe saute pan. Using a large skillet makes this a convenient one-pot meal. Grab some friends — or blue-cheese-loving family members — and serve this cozy dish alongside a contrasting crisp, green salad dressed with tart, citrus dressing. Add dessert and you’ve got a fine meal. If you choose to add lean meat, beef would be a tasty complement. After some of this warm comfort food, you may even be able to shed a few layers of those scarves and sweaters you’ve been snuggling up in to try to stay warm. Scalloped Potatoes with Blue Cheese and Mushrooms Makes 6 servings Ingredients: 2 tablespoons oil 1/2 cup chopped onion (1 small) One 8-ounce package baby bella mushrooms, sliced into 1/4-inch slices 2 cloves garlic, minced 2 tablespoons all-purpose flour 1/4 teaspoon freshly ground pepper 1/4 teaspoon salt 1 1/3 cups reduced-fat (2 percent) milk 2 ounces (1/2 cup) crumbled blue cheese, divided 4 medium (1 1/2 pounds) Yukon Gold potatoes Directions: In a large cast-iron skillet or saute pan, heat oil over medium-high heat. Add onion; cook and stir 3 minutes. Add mushrooms and garlic; cook and stir 4 minutes. Sprinkle in flour, pepper and salt; cook and stir 1 minute. Pour in milk all at once; cook and stir over medium heat until thickened and bubbly, about 3 minutes. Spoon most of the mushroom sauce into a heatproof bowl. (Do not clean skillet.) Reserve 1 tablespoon of cheese; stir remaining cheese into warm sauce. Slice potatoes into 1/4-inch thick slices; layer half the potatoes into the bottom of the skillet. Cover with half the sauce. Repeat potato and sauce layers. Cover tightly with aluminum foil. Bake in a 350 degree F oven for 40 minutes. Remove from oven; uncover and sprinkle with reserved blue cheese. Bake about 20-30 minutes more, or until potatoes are tender. Note: Slice potatoes right before using to prevent them from turning brown. Per serving: Calories 200; Fat 9 g (Saturated 3 g); Sodium 271 mg; Carbohydrate 24 g; Fiber 3 g; Sugars 5 g; Protein 7 g Serena Ball, MS, RD, is a registered dietitian nutritionist. She blogs at TeaspoonOfSpice.com sharing tips and tricks to help readers find cooking shortcuts for making healthy, homemade meals. Her recipes are created with families in mind. Related Links: Classic Comfort Foods, Lightened Up  Healthy Meal Makeovers  New-School Spins on Old-School Healthy Dishes ",
        "words_count": 611
    },
    {
        "index": 3,
        "label": "Food",
        "title": "Reading List: Red Meat Gets The Green Light, Chemicals in Canned Foods and Fast Food Facts",
        "body": "In this week’s nutrition news: Trendy dark-colored foods are taking over menus, added fiber in General Mills products and don't be afraid to eat that juicy steak or burger. Red Meat Gets The Green Light     Steak lovers, rejoice: Red meat may not deserve the bad wrap it's gotten for many years. A new Harvard study says that the risk for heart disease comes from processed meats (like bacon, cold cuts and hot dogs) rather than unprocessed steaks and burgers. Folks in the study who ate two ounces of processed meat a day were 42 percent more likely to develop heart disease,  while those who ate four ounces of red meat daily had no increased risk. Both processed and non-processed meats contain saturated fat, which contributes to heart disease, but the study suggests that it’s the salt in processed meats that may be the “really bad” culprit. What’s your take on red meat?       Alarming Amount of Canned Foods Contain BPA   We’ve told you about the chemical found in canned foods called BPA and how it’s been linked to cancer. A recent study examined how much BPA in can's metal lining leached into the food itself. The results? A whopping 92 percent of food tested (including fruits, veggies, fish and beans) contained BPA. The study concluded that if meals are prepared from various canned food, this can lead to potential harmful levels of BPA. Although some companies use BPA-free lining in their cans, many do not. The FDA is taking a closer look at the issue and has pledged $30 million to research it.     Fast Food Joints Print Calories on Receipt       Ever wonder how many calories are in the meal you ordered? Burgerville (a fast food joint in the Pacific Northwest) makes that information readily available — on your receipt! They’re rolling out this new receipt system in 39 of their restaurants this week. Although this is the first fast food joint to use this system, the “SmartReceipt” is already found in numerous hospitals and cafeterias. Would you like to see the calories in your food order?       Dark-Colored Foods Are The New Black   If you follow fashion trends, you always hear about the “new black”. But instead of clothes, we’re talking food -- black trumpet mushrooms, black garlic, black walnuts and black chickpeas are some of the foods that are appearing on menus across the country. Read up on some of the fabulous dishes being made from these ingredients. General Mills Adds Fiber With all the salt and trans fat-cutting going on, General Mills is actually adding an ingredient—fiber. They’ve added fiber to yogurt, soup and breakfast bars. So, does this fiber have the same benefit as the natural fiber found in whole grains and fresh produce? Studies aren’t conclusive to prove that all fiber is equal, but eating more fiber in general is a huge health benefit. Read more about the types of fiber and how much you really need. Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. See Toby's full bio » ",
        "words_count": 513
    },
    {
        "index": 4,
        "label": "Food",
        "title": "6 Surprising Tips for Cooking with Kids",
        "body": "For children, seeing frozen red raspberries whizzed into a shockingly pink smoothie, muffins rise in the oven, or a fried egg yolk turn from golden to light-salmon colored isn't just educational; it's magic. Cooking with kids is messy and time-consuming, but the life skills your children learn are totally worth the effort. As the mom of four children ages 5 to 12, I've spent a lot of time in the kitchen with my kids. Here are six tips that my friends find most surprising:  1. Use your sharpest knives. Dull knives are actually more dangerous than sharp knives for kids and adults. Sharp knives slide smoothly and easily through food. Knife accidents generally occur when we have to use pressure or saw our way through slicing with a dull knife. That's also when knife slippage can occur. Two keys to safety are first: Monitor children to make certain their fingers stay a safe distance from the blade. And second: Allow children to slice only items that have a flat surface and sit solidly on the cutting board; prep rounded foods like onions or apples into halves and place them on the cutting board cut-side down so the foods are sitting flat. 2. Encourage messiness. Cleaning up as you go is a wise habit to encourage. This helps keep a child's work space clear of clutter. But I found out the hard way that I was putting too much emphasis on cleanliness. When I asked my 8-year-old why she hadn't helped me in the kitchen lately, she told me she didn't want to upset me by making a mess. Point taken! Now we put more emphasis on clean-up at the end. 3. Let kids lick the beaters, spoons and their fingers. Not only is licking your fingers fun, but it helps children experience food through all their senses. (Just remind them to wash their hands after licking their fingers.) Lick the beaters after whipping up cream, but before adding sugar or vanilla to experience real creaminess. Taste a spoonful of the soup before and after adding salt; if children like the soup even before salt, you may be able to add less salt. 4. Eat dessert first. Nothing kills the joy of measuring and mixing up a batch of oatmeal cookies like being told you'll have to wait until after dinner to taste them. I'm a dietitian, but I'm still a big believer in dessert with dinner. If my kids eat dessert before dinner, that's fine; then it's seen as a component of the meal, not a reward for eating veggies. Also, they aren't eating dessert at the end of the meal, when their tummies might already be full. 5. Touch everything, even raw meat and eggs. Teach your children where their food comes from and how it feels. Have them touch dirt-encrusted vegetables. Discover the differing feel of fresh mushroom gills and smooth mushroom tops. Have them help you mix up meatloaf by squishing their hands in the raw ground meat and eggs. Children will be more apt to try a new food when they've invested in the preparation of it. 6. Don't wait for the perfect time. Let kids help make dinner even on time-crunched nights. With one kid at the table doing homework, one practicing piano (loudly), one dancing underfoot, it doesn't seem to be the perfect time to let the fourth kid help me with dinner. But I try to never say no. There is always some chopping or measuring to do. And beginning readers can read the next step on the recipe with pride. And before long, you'll be saying something like this to your kid: \"Don't forget to make a snack for your club meeting tomorrow. Here's the cookbook, have at it.\" Serena Ball, MS, RD is a food writer and registered dietitian nutritionist. She blogs at TeaspoonOfSpice.com sharing tips and tricks to help families find healthy living shortcuts. Follow her @TspCurry on Twitter and Snapchat. Related Links: Healthy Snacks Kids Can Make 10 Healthy Eating Habits to Teach Your Kids Play with Your Food: Fun Recipes for Kids ",
        "words_count": 684
    },
    {
        "index": 5,
        "label": "Food",
        "title": "This Is the Right Internal Temperature for Cooked Chicken",
        "body": "The best way to determine when chicken is cooked and safe to eat is to check its internal temperature. But what should that temperature be? And does it matter whether you baked a whole chicken in the oven, or cooked chicken breasts on the stovetop? Below you will find all this information and more, so you can feel good about your home-cooked chicken. What Is the Correct Internal Temperature for Cooked Chicken? The USDA’s Food Safety and Inspection Service (FSIS) recommends cooking whole chicken and parts of chicken (like the breasts, legs, thighs, wings and giblets), ground poultry, and stuffing to 165 degrees F.  This means that you will need to set your oven between 350 to 450 degrees F to ensure that the inside of the chicken meets the proper temperature. chicken can carry harmful bacteria on the outside, which can potentially make anyone who eats it sick. This is why it is important to cook your chicken properly, in order to destroy bacteria that can cause foodborne illness. The time needed to cook your chicken depends on your cooking method. For example, four ounces of boneless chicken breast should be roasted at 350 degrees F for 20 to 30 minutes, simmered for 25 to 30 minutes, or grilled for six to eight minutes per side. This is also why it is important to follow the cooking time and temperature listed on a recipe and then to check that the internal cooking temperature has been reached using an instant read thermometer. Check the internal temperature of the whole chicken in the innermost part of the thigh and wing. For pieces of chicken, check the thickest part of the piece. How to Marinate Chicken Safely You can marinate chicken and store it in the fridge for up to two days. Many recipes recommend that extra uncooked marinade be tossed (which will help prevent illness). You can also opt to bring the marinade to a full boil (it should be bubbling for several minutes, depending on how much marinade you have) before brushing it onto cooked chicken. Any uncooked leftover marinade should certainly be discarded. How to Cook Chicken in the Microwave Although not a popular way to cook chicken, you can use your microwave to cook it. To ensure the safety of the chicken and that the minimum internal cooking temperature is met, follow these guidelines: Microwave on medium-high (70% power). A whole chicken should be microwaved for nine to 10 minutes per pound; bone-in parts for eight to nine minutes per pound; boneless breast halves for six to eight minutes per pound. Use a bag or cover. Place whole chicken in an oven cooking bag or in a covered microwavable pot. Don't microwave a stuffed chicken. Food tends to cook quickly and unevenly in a microwave and the stuffing may not reach the safe minimum internal cooking temperature to destroy the bacteria that may make you sick. Put the thinnest pieces in the middle of the dish or rack. If you are microwaving parts of the chicken, arrange them in a dish or on a rack so thick parts of the chicken are towards the outside of the dish and thinner parts of the chicken are in the center Use liquid with boneless breast halves. If you are cooking boneless breast halves, place them in a dish with 1/4 cup of water or liquid (like chicken stock) and then cover with microwave safe plastic wrap. Let rest in closed microwave. After cooking your bone-in or boneless chicken, allow the bone-in chicken to stand inside the microwave for 10 minutes and for boneless breast to sit for five minutes. This will allow the heat to be distributed in the microwave. Check the temperature. Always check the doneness of the chicken by using a food thermometer. How to Cook Stuffed Chicken The USDA Meat and Poultry Hotline does not recommend buying a whole, uncooked stuffed chicken at the grocery store as it is highly perishable. It is also not recommended to pre-stuff whole chicken to cook at a later time. According to the USDA’s Food Safety and Inspection Service, if you choose to stuff chicken, do so immediately before cooking. If you do choose to stuff your chicken, cook any raw, perishable ingredients (like raw meat, shellfish or poultry) for the stuffing to decrease the risk of foodborne illness. The wet ingredients for the stuffing can be prepared ahead of time and kept refrigerated until used. But do not mix the wet and dry ingredients just until you are ready to spoon the stuffing mixture into the chicken cavity. Immediately cook the stuffed, raw chicken in an over that is set no lower than 325 degrees F. Why Chicken Temperature Matters Cooking chicken to the correct minimum internal temperature necessary is an important way to help prevent foodborne illness. The best way to check if your chicken reaches the correct minimum internal cooking temperature is by using a food thermometer. Related Content: 20 Mistakes Everyone Makes Cooking Chicken 70 Easy Chicken Recipes You'll Make on Repeat 33 Chicken Breast Recipes to Make for Dinner Tonight",
        "words_count": 854
    },
    {
        "index": 6,
        "label": "Food",
        "title": "What Is Cutting and Bulking? And Should You Do It?",
        "body": "A tactic once used only by serious body builders, the concept of bulking and cutting is appealing to the masses. What is this way of eating for changing body composition? Does it work and is it safe? What Is Cutting and Bulking? The concept behind cutting and bulking is a righteous one – build muscle and lose fat – but this is not always so easily achieved. This phased method of eating and training begins with “bulking” which requires eating in a caloric surplus in the hopes of increasing muscle mass and gaining weight. While eating fatty junk foods can create an increase in calories, it is recommended to bulk with healthy, higher calorie foods to prevent an onslaught of fatty calories and avoid a sharp increase in body fat. Most bulking plans suggest a macronutrient ratio of around 50 percent carbs, 30 to 35 percent protein and 15 percent to 20 percent fat. Then, a “cutting” phase is employed and aims to drop unwanted pounds of fat that may have increased during bulking, while sparing gained muscle. This phase requires a caloric deficit, but not too drastic as to prevent loss of muscle. Carbohydrate intake is decreased, and protein is increased with a common ratio looking something like 40 percent carbs, 40 percent protein and 20 percent fat. Meals can vary anywhere from three to six per day, and nutrients can be adjusted by body weight to promote 0.5 to 1.0 percent of body weight lost per week. Some research suggests protein intake as high as three grams per kilogram per day, which is far above the daily requirement of 0.8 grams per kilogram. To properly execute both cutting and bulking, exercise is required. A strong emphasis on strength training is needed and, just like diet, consistency is key to success to promote increased muscle. To put it all together, carbohydrates should be eaten both before and after training, and protein-rich meals should be emphasized after workouts to help support muscle growth. Who Should Try Cutting and Bulking – And Who Shouldn’t? Body builders and fitness models often partake in cycles of cutting and bulking for competitions and photo shoots, but the needs of these populations are highly specialized. If muscle building is desired by a healthy adult, these phases may provide some structure to help them be successful, but it must be understood that everybody will respond differently and adjustments should be made based on common sense. Athletes and avid exercisers may want to consider modifying cutting and bulking if they are actively training for a race or event. Cutting during something like marathon training would not be a good combination for optimal performance. Bulking and cutting are not quick and easy processes, and they both require a tremendous amount of discipline. Paying such close attention to calories and macros can easily perpetuate an unhealthy relationship with food and exercise, and should be avoided by anyone with tendencies towards disordered eating. People with medical conditions, including diabetes, kidney issues and thyroid disease, should not drastically change their intake of carbohydrates and protein without first talking with their medical provider. What Are the Best Foods for Cutting and Bulking? Adding and subtracting calories, while maintaining health and preventing nutrition deficiencies can be tricky. The best foods for bulking include meats; fish; poultry, full-fat dairy products; grains like breads, oats and pasta, cheese; nuts and nut butters; healthy oils; avocado; fruits; and starchy and non-starchy vegetables. For cutting, opt for only lean cuts of meat, poultry and fish, egg whites (and some whole eggs), low-fat and non-fat dairy and plenty of high-fiber fruits, non-starchy vegetables and legumes; whole grains in moderation and limited amounts of healthy fats from nuts, oils and avocado. Bottom Line: Cutting and bulking is not for everyone, but with a lot of hard work may help with body composition changes when executed responsibly. Related Content: Hydration Advice Teen Athletes Should Never Follow How to Prep for the Day Like a Peloton Instructor 8 Best Protein Powders",
        "words_count": 670
    },
    {
        "index": 7,
        "label": "Food",
        "title": "Summer Fest: Cool Cucumber Soup",
        "body": "Week three of our season-long garden party Summer Fest 2011 welcomes food and garden bloggers to feature garden-to-table recipes and tips. We’ll help you to enjoy all that this season has to offer. So far, we've delved into eggplant and peaches. This week we're getting creative with: cucumbers.  With temperatures reaching 90 degrees in many areas of the country, it's just too hot to cook. But it's never too hot to eat right, so mercury rising is no excuse to roll through the drive-through. Ellie Krieger's Cool Cucumber Soup is just the solution. It's perfect for the height of summer because: You won't need to turn on the oven or stove to make it.It's done in 20 minutes.It's a great way to use up the cucumbers growing like crazy in the garden.It clocks in at just 130 calories and 2.5 grams of fat, so makes a waistline-friendly light lunch or appetizer.Per Ellie, it's a good source of protein, Vitamin A, Vitamin C and calcium. What are you waiting for? Get out the blender and whip up this super-cool, creamy-yet-good-for you cold soup. Cool Cucumber Soup Serves 4     3 cups plain nonfat yogurt     1 English cucumber (about 1 pound), cut into chunks       1 scallion, white and green parts, coarsely chopped (about 1/4 cup)       3 tablespoons chopped fresh dill, plus sprigs for garnish       Salt and freshly ground black pepper       1 medium tomato, seeded and diced, or 3 sliced radishes       2 teaspoons olive oil   In a blender, combine the yogurt, cucumber, scallion and dill. Pulse until pureed. Season, to taste, with salt and pepper. Ladle into individual bowls. Top each serving with 2 tablespoons of diced tomato or radishes, drizzle with 1/2 teaspoon of olive oil and garnish with a dill sprig.     Per 1 cup serving:       Calories: 130       Total Fat: 2.5 grams       Saturated: Fat 0 grams       Protein: 11 grams       Total carbohydrate: 17 grams       Fiber: 2 grams       Cholesterol: 5 milligrams       Sodium: 140 milligrams   More Cucumbers from Family and Friends:     Cooking Channel: Cucumbers Stuffed with Crab-Mango Salad     Pinch My Salt: Chilled Cucumber, Kefir and Avocado Soup     What’s Gaby Cooking: Cucumber-Basil Gimlet     In Jennie’s Kitchen: Radish-Cucumber Crostini Big Girl Small Kitchen: Spicy Cucumber Salad with Shallot, Ginger and Mint     Grecian Kitchen: Summer Cucumber Salad     And Love It Too: Cucumber, Mint and Watermelon Salad     Napa Farmhouse 1885: Cucumbers Coolers with Agave Simple Syrup     Cooking With My Kid: Cucumber Limeade     FN Dish: Summer Fest: Cucumber Recipes       CIA Dropout: Relishing Cucumbers     Food for 7 Stages of Life: Cucumber Cherry Salsa     Cooking With Elise: Green Tea Cucumber Pops     Glory Foods: Cucumber and Shrimp Boat     Virtually Vegan Mama: Fire-Roasted Tomato and Cucumber Gazpacho     Food2: When Life Gives You Cucumbers, Make a Cucumber Cocktail     Recipe Girl: Bread and Butter Pickles Taste With the Eyes: Spicy Pickled Cucumbers with Wakame and Garlic Blossoms     Virtually Homemade: Cold Thai Cucumber-Mint Soup     Add a Pinch: Cucumber Tea Sandwiches     The Cultural Dish: Ahi Tuna with Cucumber Sauce and Salad     Daily*Dishin: Cool n’ Zesty Cukes: 7 Minute Summer in a Jar     Daydreamer Desserts: Cubanita Margarita     Purple Cook: Cucumber Gazpacho with Indian Flavored Shrimp Relish     Indian Simmer: Cucumber at its Best with Chaat Masala     Big Apple Nosh: Quick and Easy Homemade Pickles     Sweet Life Bake: Agua de Pepino The Sensitive Epicure: Tzatziki with Grilled Gluten-Free Pitas and Fresh Cucumbers and Peppers     Zaika Zabardast: Cucumber Gazpacho     A Way to Garden: Cucumber-Growing Q&A and the Best Pickles     Cooking with Books: Summer Fest: Cucumbers",
        "words_count": 562
    },
    {
        "index": 8,
        "label": "Food",
        "title": "No, California Is Not Banning Skittles",
        "body": "Take a deep breath, Skittles fans. Despite some initial reports to the contrary, California is not banning the candy. So why were people so worried it was? Well, here’s the deal: A couple weeks ago, the state of California passed Assembly Bill No. 418, a.k.a. the California Food Safety Act. The act, which was signed into law by Governor Gavin Newsom, prohibited, starting on January 1, 2027, the manufacturing, sale and distribution of four ingredients sometimes found in popular candies and snacks sold in the U.S.: brominated vegetable oil, potassium bromate, propylparaben and Red Dye 3. Violators could be penalized up to $5,000 for an initial violation and as much as $10,000 for each subsequent violation of the bill’s provisions. The thing is none of those ingredients are in Skittles. That is not to say that the rumor came from nowhere. An earlier version of the bill, AB 418, included another ingredient, a coloring agent known as titanium dioxide. That ingredient is actually in Skittles, as well as in M&M’s. But that ingredient is not actually included among the banned ingredients in the final bill. And even if it were, it’s the ingredients that are banned, not products. In a publicly shared statement to the state assembly, Gov. Newsom noted that several other countries have already banned the additives addressed in the bill, hailed it as a positive step toward greater food safety and asserted that the delay to 2027 will give brands “significant time for brands to revise their recipes to avoid these harmful chemicals.” “Californians will still be able to access and enjoy their favorite food products, with greater confidence in the safety of such products,” the governor says. But, wait, should the rest of us be concerned about the ingredients that will soon be prohibited in California? We reached out to Toby Amidor, MS, RD, CDN, FAND, award-winning nutrition expert and Wall Street Journal best-selling author of Up Your Veggies, to get her perspective. Amidor says many of the ingredients targeted in the bill are “safe in the minute levels they are used and will not cause harm.” She noted that brominated vegetable oil, which the U.S. Food & Drug Administration (FDA) allows to be added to food only in very small amounts of no more than 15 parts per million, is used in the U.S. as a stabilizer in fruit-flavored beverages. “At this time, the FDA is working to remove the use of BVO in food and beverages as new scientific evidence reveals that there is not a reasonable certainty that BVO causes no harm,” Amidor says. Potassium bromate, an oxidizing agent used in bread doughs and baked goods, is also regulated by the FDA, which limits the amount that can be added to foods. “Research shows that potassium bromate doesn’t cause harm in humans when consumed in properly heated baked goods and bread,” Amidor says. “However, there is research where rodents were given a significantly high amount of potassium bromate and the results showed that the ingredient could harm DNA, the cells and potentially cause cancer.” People “do not consume potassium bromate at [the] high levels given to the rodents ever.” So, Amidor says, “It is safe in the regulated level.” Propylparabens, a synthetic ingredient used in small amounts in food and beverages to halt the growth of bacteria and other microbes, are also generally recognized as safe by the government and allowed in small amounts. As for the final ingredient targeted in the bill, the synthetic food coloring Red Dye No. 3, the Center for Science in the Public Interest says, “even the FDA” acknowledges it as a carcinogen (a.k.a. cancer-causing) ingredient. Yet it lurks in countless candies, cakes and other foods and should be avoided. (Find a partial list here.) Here’s the thing, though, Skittles do not contain Red Dye No. 3. — neither do M&M’s, BlowPops, Smarties, Nerds, Twizzlers, Red Vines and RedHots. Still, candies like Skittles and M&M’s, despite being Red 3-free “are not a food you want to include in your diet regularly,” Amidor says. “Not because they will cause toxicity” — the small amounts of titanium oxide in them is not a big deal — “but because they are not filled with good-for-you nutrients and are considered an empty-calorie food” and better enjoyed an as an occasional treat. Overall, Amidor believes the California bill is “an exaggeration of water cooler and social media talk” and doesn’t take into account all existing scientific evidence. Regardless, she suspects companies may tweak their food or beverage formulas to meet consumer demands. “Does it mean the ingredients aren’t safe? No,” Amidor says. “But … I have a feeling this is what we will see.” Related Content: Two Popular Sour Rolling Candies Are Recalled Due to Choking Hazard How Much Caffeine Is Too Much Caffeine? How To Put Together a Balanced, Fully Plant-Based Plate",
        "words_count": 810
    },
    {
        "index": 9,
        "label": "Food",
        "title": "When Cravings Call, What Are They Saying?",
        "body": "We all get cravings, but when they come in the form of high-sugar and calorie-dense foods, it's our waistlines that suffer the consequences. But understanding the messages behind cravings can make it easier to resist the siren call of certain foods. Why We Crave One theory as to why we crave specific foods so intensely is that the body is deficient in a nutrient that food contains. For example, we desperately crave potato chips because our body is in need of salt. This theory, unfortunately, lacks scientific evidence to back it up. But carb cravings are another story. When we eat high-carb foods like bread and pasta, our blood sugar rises. This causes the body to release the hormone insulin. Insulin triggers the amino acid tryptophan to pass into the brain -- and then comes the serotonin. This chemical messenger helps regulate mood. Low serotonin levels have been associated with irritability, fatigue, impatience, depression and anger. One theory is that when the body has cravings for carbs, it may be a sign that serotonin levels are low. Other cravings may be psychological. Depression, boredom and sadness can promote cravings. The types of food a person craves during especially emotional times depends on the individual. Managing Cravings Where there's a will, there's a way to overcome most food longings. 1. Be prepared:  Arming yourself with the right foods -- meaning, not the ones you typically crave but healthier options that can similarly satisfy -- is one good strategy. For instance, if you hanker for sweets, top nonfat plain Greek yogurt with fresh fruit and a touch of honey. If you're more of a salt buff, have a handful of nuts always at the ready. If you're keen on chocolate, give in, just keep it simple: One ounce of dark chocolate should do the trick. 2. Re-train taste buds: Are you used to super-salty or extremely sweet foods? You can help adjust taste bud preferences by slowly scaling back on added salt and added sugar over time. If your body isn't accustomed to as much, you won't need as much to satisfy a craving. 3. Walk it off: Research has found that exercise can help curb cravings. One study published in Medicine and Science in Sports and Exercise found that exercise decreased cravings for food in women, making them less likely to eat them. 4. Picture it: A 2011 study in Appetite found that replacing the mental image of a craved food (a doughnut) with an image of a favorite activity (like tennis) -- and drawing on all the senses, sounds and colors associated with that activity -- could help reduce the intensity of a craving. 5. Wait it out: Let 20 minutes go by to see if the craving passes. Doing this will also give you more time to make a healthier choice. Stress reduction techniques such as meditation, breathing or taking a hot bath -- or changing your environment by taking a walk or drinking some soothing tea -- can help a craving move on and move out. Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. She is the author of The Greek Yogurt Kitchen: More Than 130 Delicious, Healthy Recipes for Every Meal of the Day.",
        "words_count": 548
    },
    {
        "index": 10,
        "label": "Food",
        "title": "This Week's Nutrition News Feed",
        "body": "In this week's news: California takes a hard stance on soft drinks; marketers realize there's more bread to be made in the gluten-free aisle; and an amino acid in spinach gets the spotlight. California to Bust Soda's Bubble? Along with several medical experts, a California state senator proposed adding a warning label to the packaging of sodas not unlike what now appears on cigarette packaging. The wording -- developed by a panel of national healthcare leaders -- would read, “STATE OF CALIFORNIA SAFETY WARNING: Drinking beverages with added sugar(s) contributes to obesity, diabetes, and tooth decay.\" According to data cited, one soda a day raises an adult's chances of being overweight by 27 percent and a child's by 55 percent. In the Gluten-Free Market, the Dough Keeps Rising Despite the fact that only about six percent of the population is gluten-sensitive, eleven percent of US families now purchase gluten-free products, and 30 percent say they want to cut back on gluten consumption. According to the New York Times, the gluten-free category is expected to reach $15 billion in annual sales in 2016. There are multiple reasons behind the boom (including a national preoccupation with gut health, according to one analyst) -- and many ramifications, such as increased produce consumption (fruits and veggies are, after all, naturally gluten-free). For a Good Workout, Hold the Vitamin Supplements Part of the appeal of vitamins lies in their ability to help neutralize free radicals, which can damage cells in the body. And because exercise increases free radical production, it's not uncommon for serious athletes to load up on supplements as part of the recovery regimen. But a new study published in the Journal of Physiology indicates this might not be the best appproach. When 54 male and female volunteers were given pills that contained either a placebo or high levels of vitamins C and E before working out, those taking the supplements showed less improvement in muscular endurance and other health benefits, suggesting there's actually a function for some of the free radicals made in those instances. The Secret to Popeye’s Spinach Might Be Faster Reflexes When it comes to reflexes and reactions, who doesn't want a touch of super-speed, whether it's a quick move at the wheel or a pithy 140-character comeback? Now, a team of German researchers think they might have a lead on something that can help: the amino acid tyrosine, commonly found in foods like spinach, eggs and soy. In a double-blind study published in the journal Neuropsychologia, the scientists found that subjects who drank orange juice laced with tyrosine performed better at a computer game designed to measure cognitive and physical reaction time than those who drank the juice with just placebo. Researchers speculated that bumping up intake of the dopamine-driving amino acid might make people less likely to reach for academic performance-enhancers such as Ritalin. Sara Reistad-Long writes about science, wellness and lifestyle. She is the co-author of The Big New York Sandwich Book and can be followed on Twitter: @sarareistadlong",
        "words_count": 503
    },
    {
        "index": 11,
        "label": "Food",
        "title": "Feed Your Brain: 4 Healthy Foods with Brain-Boosting Nutrients",
        "body": "We’ve all had those days when our brains feel foggy: when we can’t focus and our memory is less-than sharp. And chances are, you’ve resorted to extra caffeine and a sugary snack in an effort to jolt your brain back into full function. But what if you could consume something that’s actually healthy for your brain instead? That’s the idea behind numerous supplements, foods and drinks that contain nootropics, substances purported to improve cognition. Nootropic cocktails may contain any number of things including B vitamins, L-theanine, niacin, as well as various herbs and amino acids. But despite the growing popularity of these brain boosters, there is little scientific evidence to back up most of their claims. “I love the idea of boosting brain power, but show me any science that a supplement is better than movement, meditation and nutrient-dense brain food when it comes to mental health,” says Drew Ramsey, MD, assistant clinical professor of psychiatry, Columbia University and author of Eat Complete (Harper Collins, 2016). According to Ramsey, boosting brain power is actually pretty simple. He even made a little rhyme about the key brain foods to make it easy to remember: “Seafood, greens, nuts and beans.” Eating more of those core foods can go a long way toward keeping your brain healthy—and a healthy brain works better. Important nutrients for feeding your brain include omega-3 fats, monounsaturated fats, vitamin B12, zinc, magnesium, iron, choline, lycopene, vitamin E and carotenoids. It’s not about a specific food or magic bullet supplement, but rather categories of healthy foods that provide high levels of these proven brain-boosting nutrients. “Our brains consume 20 percent of everything we eat,” says Ramsey. “This nourishment provides energy and nutrients to create and sustain the quadrillions of connections that construct the brain, plus the electricity that courses between those connections.” In other words: if you want a better brain, feed it better food. Crispy Shrimp with Greens and Beans Serves 4 Lovers of fried seafood take note. This crispy panfry is a healthier option than your usual deep fry. Pick your shrimp well (wild with no salt preservative) for a high-protein, iodine-rich seafood option that is appealing for kids and those new to seafood. By subbing in the greens and beans for biscuits or fries, not only do you get a major nutrition boost, but you also load up on filling fiber. Ingredients: 1/2 cup gluten-free pancake mix 1/2 cup Parmesan cheese 2 tablespoons ground flaxseeds 2 tablespoons pumpkin seeds 1 teaspoon dried herbs, such as Italian seasoning 1 pasture-raised egg 1 pound large shrimp, peeled, deveined, tails removed 3 tablespoons olive oil 1/2 pound Swiss chard or kale, chopped 2 garlic cloves, thinly sliced One 15.5-ounce can no-salt-added chickpeas or navy beans, rinsed well under cold running water and drained Directions: Place the pancake mix, cheese, flaxseeds, pumpkin seeds, and herbs on a plate and toss with your fingers to mix. Whisk the egg in a shallow bowl. Dip a shrimp in the beaten egg and press into the pancake mixture, then transfer to a large clean plate. Repeat with the remaining shrimp, working in batches as needed, and place in the fridge while you prepare the greens. Warm 1 tablespoon of the olive oil in a large skillet and add the greens and garlic. Toss well and cook for 1 to 2 minutes until the greens have wilted. Add the beans and toss again. Turn off the heat and set aside. Heat a separate large skillet over medium heat and add the remaining 2 tablespoons olive oil. Add the shrimp and cook for 4 to 6 minutes, turning occasionally, until the shrimp are crispy and cooked through. Transfer to a plate lined with a paper towel. Place the greens on four plates, dividing them equally, and top with the shrimp. Serve immediately. Per serving: Calories 525; Fat 19 g (Saturated 3 g); Cholesterol 1 g; Sodium 461 mg; Carbohydrate 51 g; Fiber 11 g; Sugars 11 g; Protein 38 g Recipe and photo courtesy of  Drew Ramsey. Sally Wadyka is a Boulder, Colorado-based journalist who writes about nutrition, health and wellness ",
        "words_count": 686
    },
    {
        "index": 12,
        "label": "Food",
        "title": "Please! For the Love of Food Safety, Stop Washing Your Chicken",
        "body": "Do you rinse raw chicken under the kitchen faucet before cooking it? Julia Child did it regularly, and rinsing chicken before prepping and cooking has become common practice in many households. A study from Drexel University found that approximately 90% of people say they wash their chicken before cooking it as historically recipes did instruct people to do so. Even today many folks believe that rinsing chicken can wash away pathogenic bacteria and make the chicken safe to eat. We're here to settle this debate once and for all. Why You Shouldn't Rinse Chicken Raw chicken can be contaminated with numerous pathogenic bacteria including Campylobacter, Salmonella, and Clostridium Perfringens, all of which can lead to foodborne illness. The study done at Drexel University found that rinsing chicken only increased the chances of spreading bacteria around your sink and counter tops. They even started a website called Don’t Wash Your Chicken, which explains that raw chicken can carry bacteria on the outside, and that research shows that washing poultry under running water can cause the bacteria to spread. Although you may not see the water splashin, you could be getting bacteria getting all over the place, including the counter tops, kitchen towels, and anything that is nearby. It does happen. On the Don’t Wash Your Chicken website there is this video animation  showing how far the bacteria spread! If the bacteria do get on raw produce or is ingested especially by young children, pregnant women, older adults, and those with a weakened immune system, it can cause them to get sick. This is why for the first time in 2005, the USDA’s Dietary Guidelines for Americans included food safety, and advised against rinsing chicken before cooking. The reason is exactly what the studies found, that those chicken juices get all over the place and can potentially get someone sick. How to Handle Raw Chicken Safely There is always a chance that you can contaminate the chicken from the time you pick it up in the store until the time you consume it. To keep the chicken safe to eat, there are simple steps you can follow. When shopping: Once you purchase the chicken, bag it in a disposable bag to prevent the raw juices from getting onto other foods, especially raw foods like fruits and vegetables.When storing: Place the chicken in the disposable bag on the bottom of the refrigerator to prevent juices from dripping onto ready-to-eat foods.When handling: Always wash your hands with soapy water for at least 20 seconds before handling raw chicken. Do not wash the raw chicken. Instead, take the chicken out of the package and put it directly into the cooking pan. The heat from cooking will destroy bacteria that are present as long as you reach the proper internal cooking temperature. Use a thermometer to ensure that the chicken has reaching an internal cooking temperature of 165-degrees Fahrenheit.When prepping: If you need to prep the chicken, including removing the skin or breading, use a separate cutting board and knife for raw chicken. Never place cooked food or fresh produce on a plate or cutting board that has been in direct contact with raw chicken. Always wash the plate or cutting board first with hot soapy water.When storing leftovers: If you do have leftovers, refrigerate or freeze the chicken within two hours, or within one hour if the temperature is over 90-degrees Fahrenheit. Bottom Line If you’re in the habit of washing your chicken before cooking….stop it! You can get someone sick. To minimize the risk of food poisoning in your home, handle your chicken with care from when you purchase it until you cook it. Toby Amidor, MS, RD, CDN, is a registered dietitian and consultant who specializes in food safety and culinary nutrition. She is the author of The Greek Yogurt Kitchen: More Than 130 Delicious, Healthy Recipes for Every Meal of the Day. *This article was written and/or reviewed by an independent registered dietitian nutritionist. Related Links: Is Seltzer As Hydrating As Regular Water? Best High-Energy Foods Snacks with 100 Calories or Less",
        "words_count": 680
    },
    {
        "index": 13,
        "label": "Food",
        "title": "Blogger Spotlight: Lindsay Nixon from Happy Herbivore",
        "body": " Lindsay is passionate about her plant-based, low-fat diet. Along with the Happy Herbivore blog, Lindsay has authored two successful cookbooks and offers meal planning services for both individuals and families. Most of her recipes come together in twenty minutes, making them accessible for busy home cooks. She uses mostly whole, unprocessed foods, and refrains from adding fat to the meals she prepares.Why did you and your husband choose to adopt a vegan lifestyle? Initially I was motivated by the plight of farm animals and the amazing health benefits associated with a plant-based diet. My husband, on the other hand, was more drawn to it from an environmental aspect and we've since rubbed off on each other. Now we're both motivated by our health, the animals and the environment. Eating a plant-based (vegan) diet has truly changed our lives. Is it difficult to cook without using oils and butter?  Which ingredients do you use as substitutes? It's very easy. Instead of oil I saute in vegetable broth or water and I bake or broil instead of frying. With baked goods I replace butter and oil with applesauce or pumpkin most of the time, but have also used shredded zucchini and beans (Yes! Beans! It's amazing how well they work). I find cooking this way also allows for a greater depth of subtle flavors. Oils and butters tend to coat the tongue, so it's a little like tasting food with a glove on. Once you take them away, the components in the dish really shine. How do you resist temptation for junk food? Part of my motivation for eating a plant-based (vegan) diet is focused around my health. I know what animal products how bad they leave me feeling. I also had a serious health scare in my early 20's before I was plant-based and I like to keep that in focus. \"Nothing tastes as good as being healthy feels,\" I always say. It also helps to know that I can make a healthier, vegan version of a junk food (i.e. cinnamon bun or meatball sub) at home that'll taste just as good but without any downside. Aside from eating well, how do you stay in shape? I've found that as long as I eat a low-fat (no oil) whole foods, plant-based diet, I can maintain my weight (and a slender figure) even during periods of total inactivity. Prior to eating a plant-based (vegan) diet I was a bit of a couch potato. Walking around the mall was tiring. Changing my diet, however, improved my energy and health in life-altering ways. 10 months after adopting a vegan diet, I ran a marathon. I've also become an avid snowboarder and hiker. I guess you could say I keep a fairly active lifestyle now. Anytime I'm sweating from physical exertion, I stop to marvel at how much I've changed! What is your go-to weeknight meal? When I'm not in the mood to cook, I make either bean burgers (just 6-ingredients!), tofu scramble (adding in whatever veggies and beans I have on hand) or cooked greens (i.e. kale) with a cooked grain (i.e. brown rice), beans (i.e. black beans) and a flavorful sauce such as homemade mushroom gravy or a fun salsa (i.e. pineapple salsa). Do you have any tips for people looking to start a vegan diet on a budget? Staples like beans and lentils, whole grains, seasonal fruits and vegetables are a bargain. For your health and wallet, try to stick to those ingredients rather than splurging on the expensive (and not-so-healthy) vegan substitutes like fake meats, fake cheeses and other gourmet or specialty ingredients. Those items can be helpful during transition, but they're not health foods (or cheap). Also remember that meals don't have to be complicated. A bag of frozen stir-fry vegetables with brown rice and a splash of soy sauce or teriyaki sauce is a fast and delicious meal. I also like to make pepper fajitas: bag of frozen peppers, a fajita seasoning packet and tortillas. Of course you can totally have fancy and gourmet fare as a vegan, but if you're trying to cut cost, go back to the basics. Also try to buy in bulk (i.e. from the bulk bin), buy local and buy seasonal. Frozen items also tend to be a bargain. At my supermarket you can get 10 bags of veggies for $10!",
        "words_count": 727
    },
    {
        "index": 14,
        "label": "Food",
        "title": "Iron Chef Jose Garces’ Healthy Tips for Kids",
        "body": "As a dad to two young children, Jose Garces is no stranger to the challenges that come with cooking for little eaters, but that doesn’t stop him from serving healthful fruits and veggies at home. This Iron Chef knows how to transform everyday ingredients into flavor-packed meals that are not only kid-approved but packed with nutrition, too. We checked in with Jose to find out his simple strategies for kid-friendly cooking and asked him to share a few simple suggestions to start the school year on a healthy note. Check out his best lunchbox picks, after-school snack solutions and more below, then get his top five healthy-eating tips for kids. Back-to-school season is officially here, and many moms and dads are wondering how to pack healthful lunchbox meals that their kids will actually enjoy eating. When you’re packing your children’s lunches, what staples do you reach for? The best thing you can send kids to school with is fruit. My wife, Beatriz, and I like to slice up apples, pears and strawberries for our two children. We’ll also pack their lunches with blackberries, blueberries and maybe a banana. And our kids love oranges, so we’ll peel and segment them sometimes, too. In the thermos it’s usually black bean soup with brown rice -- have to use the brown rice! To change that up, we’ll fill the thermos with whole-wheat vermicelli made with low-sodium chicken broth, diced carrots and shredded chicken breast or broccoli-potato soup made with vegetable stock. Kids really like something crunchy in there, so we’ll give ours a few crackers or homemade croutons on the side to dip or just add in. Between two slices -- always whole-wheat or multi-grain slices -- Beatriz and I will make them one of these simple and delicious sandwiches: natural peanut butter with homemade preserves or plain cheese, usually cheddar or mozzarella. Once in a while, for a treat, we’ll make Nutella and banana sandwiches for them. Speaking of back-to-school, so many kids come home ravenous after a long day and ask for pre-dinner snacks. Can you recommend any good-for-you munchies to satisfy their after-school snack cravings? I think natural granola bars with yogurt (Wallaby's Australian peach, blackberry and strawberry are favorites), or even just plain, are a great choice for an after-school bite. It’s just enough to hold them over until dinner without ruining their appetites. What advice can you give parents whose children are picky eaters? Have you discovered any tried-and-true techniques for introducing more fruits and vegetables to your kids’ diets? This is a big lesson in professional kitchens, but it really applies at home, too: a monochromatic plate of food is never exciting. We want to get kids excited about trying new foods, and color can be a great gateway to that. Making a colorful plate is very appealing to kids and studies show that it can be an excellent nutritional move, and the visual appeal is undeniable as well. Setting a good example is always a great start. Most kids are interested in what their parents are eating, and if you are eating a wide variety of healthful foods, there's a good chance your kids will follow suit. Since the fall season is just a few weeks away, can you share any tips for turning autumn produce, like cauliflower, squash and sweet potatoes, into kid-approved dishes? The fall harvest is filled with excellent nutrition and incredible natural flavor, so produce is best prepared simply. Roasting is an excellent technique for retaining nutrition and bringing out the natural sweetness of many autumn fruits and vegetables. Hold the butter and add a sprinkle of kid-friendly autumn spices like cinnamon, ginger and nutmeg to sweet treats like sweet potatoes for a kid-friendly favorite. Healthy Eating Tips for Kids: Finding ways to work healthy elements into classically unhealthy dishes is a great way to up their nutritional content -- and keep kids full of good stuff instead of bad. Quesadillas are a great example: all that cheese seems like a poor choice, but if you replace half the cheese with healthy goodies like veggies or greens (my kids love roasted red peppers and pea greens), you’re adding vegetables into a crave-able snack food.Roasted red peppers are great for more than just punching up a quesadilla. Roasted vegetables in general take on a sweetness that their raw counterparts can lack, and that appeals to kids. Plus, roasting is a simple cooking method that doesn't add extra fat or calories.Kids tend to love creamy textures. Instead of always relying on dairy, look to avocados: On their own, they may be unappealing, but as a dip, especially with other full-flavored ingredients, they’re perfect (and loaded with vitamins and healthy fats). Who doesn’t love guacamole?Cooking in season is a great way to avoid adding unhealthy fats and calories to your dishes.  Fresh vegetables and fruits are loaded with flavor.  Fewer ingredients can help satisfy pickier eaters, and a simple drizzle of olive oil, plus salt and pepper, is usually enough for just about any fresh veggie.  Fruit is even easier: Just choose those that look most ripe and enjoy! Find out more about Jose Garces and tour his home kitchen.",
        "words_count": 865
    },
    {
        "index": 15,
        "label": "Food",
        "title": "Summer Fest: The Fresh-for-Once Tomato",
        "body": "There’s the bottle of ketchup in the fridge. A weightlifter’s load of canned tomatoes in the pantry—crushed and whole, of course. You’ve got your tomato paste, your bag of sun-dried, your jar of marinara, your jarred salsas and your canned tomato soups. You could survive a natural disaster with the amount of tomatoes in your house. In its preserved form, the tomato is your lifeblood, your fallback. A sauce injects limp pasta with life and tomato soup reinvigorates grilled cheese with just a dip. It graces the tops of our favorite pizzas and finds its way on top of our hotdogs. Tomato products—keyword: products—build the foundation of our kitchens and is one of the only products that we do not insist on freshness. And that’s fine, up until a certain point. But when tomato season rolls around, close the pantry door and leave the fridge locked shut. The only red rolling around on your kitchen counter should be the real thing, the real tomato.  We are done with tomato in its disguised form and ready to tear into a juicy one straight from the vine. Taken raw, they are acidic and juicy. Met with a simmering heat, it’s an entirely different ballgame. Expand your fresh tomato repertoire with a series of healthy recipes, both cooked and uncooked. The Uncooked: Just As Nature Intended Stick your fork in a fresh, polychromatic Tomato Salad (above) with a simple balsamic and brown sugar dressing. Ellie’s uses plum tomatoes in her peppery, blender-bound Tomato Salsa because they’re super meaty. Top your next salad with Tomato Ginger Dressing, a zesty blend of both sun-dried and fresh tomatoes. Embark on some hardcore dicing with Ellie’s Tomato, Cucumber and Red Pepper Relish as a light side or a colorful salad. The Cooked: With a Zap of Heat Ina roasts plum tomatoes in olive oil for her summery Roasted Tomato Basil Soup, which is chock-full of basil and made complete with a dollop of yogurt. Got a grill? Paula’s Garlic Grilled Tomatoes are oozing with heated juices. Bobby Deen’s Baked Green Tomatoes are a slimmer version of the fried southern classic that are still crunchy as ever. Rachael’s Tomatoes Stuffed With Tabbouleh Salad make for a compact spin on a nourishing dish. One stuffed tomato recipe just wasn’t enough. Alton’s version of Stuffed Tomatoes is jam-packed with a heartening trio of mushrooms, goat cheese and bread crumbs. Sure, gazpacho goes down cold. But this Charred Tomato Gazpacho reels in a toasted flavor by grilling the tomatoes first. More Tomato Recipes from our Family and Friends: Cooking With Elise:Fresh Tomato Sauce  Jeanette's Healthy Living:Tomato Gazpacho Salsa Napa Farmhouse 1885:Tomato Cobbler Anyone?  Virtually Homemade:Spaghetti With Tomatoes, Prosciutto and Fresh Corn What's Gaby Cooking:Chicken Kebabs With Romesco Sauce Big Girls, Small Kitchen:Salmon Spaghetti With Plum Tomatoes and Avocado Feed Me Phoebe:Roasted Fresh Tomato Puttanesca Sauce Chez Us:Easy Tomato Tart Made By Michelle:Tomato and Pesto Pizza Ingredients, Inc.:Lighter Fried Green Tomatoes Delicious Lean:Creamy Light Tuna Salad Stuffed Tomatoes Daily*Dishin:Spicy Tomato-Tomatillo Chicken Tenders From My Corner of Saratoga:Tomato Jam Dishin & Dishes:Tomato Zucchini Frittata And Love It Too:Roasted Garlic, Basil and Tomato Paleo Tart Healthy Eats:The Fresh-for-Once Tomato Sweet Life Bake:Pico de Gallo Zaika Zabardast:Grilled Tofu and Sun-Dried Tomato Pesto Sandwich Thursday Night Dinner:Tomato and Watermelon Salad Cooking Channel:How to Prepare Summer Tomatoes FN Dish:Tomatoes Go Beyond Salads",
        "words_count": 555
    }
]